
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum neppartjan munkaspart
>  szolidaritas ervenytelen

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0 & `jelolt'>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS = 467274.4
Iteration 1:  Residual SS = 244384.6
Iteration 2:  Residual SS = 194607.9
Iteration 3:  Residual SS = 148004.6
Iteration 4:  Residual SS = 141951.4
Iteration 5:  Residual SS = 140807.4
Iteration 6:  Residual SS = 140807.4
Iteration 7:  Residual SS = 140807.4


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,280
       Model |  1.024e+08          6  17059210.9    R-squared     =     0.9986
    Residual |   140807.4       1274  110.523861    Adj R-squared =     0.9986
-------------+----------------------------------    Root MSE      =   10.51303
       Total |  1.025e+08       1280   80075.057    Res. dev.     =   9649.165

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .7875828   .0592916    13.28   0.000      .671263    .9039026
   /mihazank |  -173.6393          .        .       .            .           .
      /tisza |   .4364345   .0161931    26.95   0.000     .4046665    .4682025
        /lmp |   -12.6018          .        .       .            .           .
     /fidesz |  -4.42e+07          .        .       .            .           .
         /dk |   63623.39          .        .       .            .           .
   /momentum |   2.050606   .5264318     3.90   0.000     1.017838    3.083375
 /neppartjan |  -617821.9          .        .       .            .           .
 /munkaspart |   .3947795   .0918353     4.30   0.000     .2146144    .5749445
/szolidari~s |   .7865388   .3178404     2.47   0.013     .1629906    1.410087
/ervenytelen |  -.0944601   .1081716    -0.87   0.383    -.3066742     .117754
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(31 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0152063       .0011204
 5%     .1103671       .0051604
10%     .2181738       .0051938       Obs               1,280
25%     .5887644        .005576       Sum of wgt.       1,280

50%     1.222633                      Mean           1.462886
                        Largest       Std. dev.      1.180838
75%     2.044736       6.363466
90%     3.033588       6.828703       Variance       1.394379
95%     3.812595        7.27411       Skewness       1.363693
99%     5.357903       7.877372       Kurtosis       5.420801

Iteration 0:  Residual SS = 206531.5
Iteration 1:  Residual SS = 190660.1
Iteration 2:  Residual SS = 188553.5
Iteration 3:  Residual SS = 188549.6
Iteration 4:  Residual SS = 188549.6
Iteration 5:  Residual SS = 188549.6
Iteration 6:  Residual SS = 179188.9
Iteration 7:  Residual SS =   177064
Iteration 8:  Residual SS = 176777.5
Iteration 9:  Residual SS = 176761.3
Iteration 10: Residual SS = 176760.9
Iteration 11: Residual SS = 176760.9
Iteration 12: Residual SS = 176760.9


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,280
       Model |  1.003e+08          8  12534813.8    R-squared     =     0.9982
    Residual |  176760.89       1272  138.962965    Adj R-squared =     0.9982
-------------+----------------------------------    Root MSE      =   11.78826
       Total |  1.005e+08       1280  78480.6805    Res. dev.     =   9940.243

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   -.756843   .0675931   -11.20   0.000    -.8894493   -.6242367
   /mihazank |  -1.349269   .2774271    -4.86   0.000    -1.893534   -.8050037
      /tisza |  -.5302671   .0263915   -20.09   0.000    -.5820427   -.4784915
        /lmp |   58082.08          .        .       .            .           .
     /fidesz |   1.313564   .0534669    24.57   0.000     1.208672    1.418457
         /dk |  -9.83e+07          .        .       .            .           .
   /momentum |  -1.910568   .4513033    -4.23   0.000    -2.795949   -1.025187
 /neppartjan |  -264910.1          .        .       .            .           .
 /munkaspart |  -.5921416   .1145479    -5.17   0.000    -.8168651   -.3674181
/szolidari~s |  -1.701604   1.113729    -1.53   0.127    -3.886552    .4833437
/ervenytelen |  -.7976268   .1741297    -4.58   0.000     -1.13924   -.4560137
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(31 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0234347       .0001249
 5%     .1214666       .0007298
10%     .2553619       .0052367       Obs               1,280
25%      .695498        .008493       Sum of wgt.       1,280

50%     1.345418                      Mean           1.685051
                        Largest       Std. dev.      1.484056
75%     2.304634       8.456932
90%     3.516721       9.176434       Variance       2.202422
95%     4.281429       15.49686       Skewness       3.605823
99%     6.117571       22.24224       Kurtosis       38.03889

Iteration 0:  Residual SS =  4094284
Iteration 1:  Residual SS =   439073
Iteration 2:  Residual SS =   109093
Iteration 3:  Residual SS = 77744.86
Iteration 4:  Residual SS = 55043.84
Iteration 5:  Residual SS = 53265.24
Iteration 6:  Residual SS = 49437.39
Iteration 7:  Residual SS =  48621.1
Iteration 8:  Residual SS = 48618.83
Iteration 9:  Residual SS = 48618.83
Iteration 10: Residual SS = 48618.83


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,280
       Model |  1144587.2          6  190764.528    R-squared     =     0.9593
    Residual |  48618.829       1274  38.1623465    Adj R-squared =     0.9591
-------------+----------------------------------    Root MSE      =   6.177568
       Total |    1193206       1280  932.192188    Res. dev.     =   8288.036

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   -2633855          .        .       .            .           .
   /mihazank |   1.477485    .170239     8.68   0.000     1.143505    1.811464
      /tisza |  -12.55165          .        .       .            .           .
        /lmp |  -1.807425    .145538   -12.42   0.000    -2.092945   -1.521904
     /fidesz |   -2.09615   .0991566   -21.14   0.000    -2.290679   -1.901622
         /dk |  -26.82639          .        .       .            .           .
   /momentum |  -13.87405          .        .       .            .           .
 /neppartjan |   6.10e+07          .        .       .            .           .
 /munkaspart |  -2.183982    .541221    -4.04   0.000    -3.245764     -1.1222
/szolidari~s |  -1.426902   .3797268    -3.76   0.000    -2.171861   -.6819438
/ervenytelen |  -.9260854   .1013579    -9.14   0.000    -1.124932   -.7272388
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(31 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0167555       .0016665
 5%     .0887589       .0018469
10%     .1652307       .0028484       Obs               1,280
25%     .3763461       .0037556       Sum of wgt.       1,280

50%     .7243442                      Mean           .9020748
                        Largest       Std. dev.      .7286668
75%     1.220414       4.075297
90%     1.865909       4.563928       Variance       .5309553
95%     2.275998       5.016377       Skewness       1.689878
99%     3.388459       6.402571       Kurtosis       7.986079

Iteration 0:  Residual SS =  4143605
Iteration 1:  Residual SS = 429820.5
Iteration 2:  Residual SS = 126742.2
Iteration 3:  Residual SS = 93788.37
Iteration 4:  Residual SS = 76416.51
Iteration 5:  Residual SS = 76038.82
Iteration 6:  Residual SS = 64006.12
Iteration 7:  Residual SS = 63726.73
Iteration 8:  Residual SS = 63717.51
Iteration 9:  Residual SS = 63717.22
Iteration 10: Residual SS = 63717.22
Iteration 11: Residual SS = 63717.22
Iteration 12: Residual SS = 63717.22


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,280
       Model |  430997.78          7  61571.1118    R-squared     =     0.8712
    Residual |  63717.217       1273  50.0528021    Adj R-squared =     0.8705
-------------+----------------------------------    Root MSE      =   7.074801
       Total |     494715       1280  386.496094    Res. dev.     =   8634.204

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.643187   .1144052   -14.36   0.000     -1.86763   -1.418743
   /mihazank |  -1.976976   .4423353    -4.47   0.000    -2.844762   -1.109189
      /tisza |  -44262.14          .        .       .            .           .
        /lmp |  -5384.375          .        .       .            .           .
     /fidesz |  -1.561613   .0428648   -36.43   0.000    -1.645706   -1.477519
         /dk |  -21973.53          .        .       .            .           .
   /momentum |   -3.00854   3.780611    -0.80   0.426    -10.42545    4.408372
 /neppartjan |   12.48288          .        .       .            .           .
 /munkaspart |  -2.337899   .8771453    -2.67   0.008    -4.058708   -.6170896
/szolidari~s |  -1.336771   .3839964    -3.48   0.001    -2.090106   -.5834353
/ervenytelen |  -.2391717   .0774411    -3.09   0.002    -.3910979   -.0872456
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(31 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0088244       .0007158
 5%      .061748        .001476
10%     .1164806       .0027801       Obs               1,280
25%      .346085       .0033462       Sum of wgt.       1,280

50%     .7393242                      Mean           .9798372
                        Largest       Std. dev.       1.06916
75%     1.287423       7.273414
90%     1.932219       7.939721       Variance       1.143102
95%     2.619643       8.549953       Skewness       5.309039
99%     5.053816       18.42929       Kurtosis        65.0079

. 
. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(3 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
