
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum kispartok

. local jeloltek karacsony vitezy grundtner ervenytelen 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS =  1260641
Iteration 1:  Residual SS =  1158618
Iteration 2:  Residual SS =  1158580
Iteration 3:  Residual SS =  1109215
Iteration 4:  Residual SS =  1033255
Iteration 5:  Residual SS =  1032483
Iteration 6:  Residual SS =  1032478
Iteration 7:  Residual SS =  1032478
Iteration 8:  Residual SS =  1032478


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        960
       Model |   68946433          5  13789286.5    R-squared     =     0.9852
    Residual |  1032478.5        955  1081.12928    Adj R-squared =     0.9852
-------------+----------------------------------    Root MSE      =   32.88053
       Total |   69978911        960   72894.699    Res. dev.     =    9425.68

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .8704671   .2113203     4.12   0.000     .4557613    1.285173
   /mihazank |  -42.62726          .        .       .            .           .
      /tisza |   .3834548   .0874453     4.39   0.000     .2118477    .5550619
        /lmp |  -5062.657          .        .       .            .           .
     /fidesz |  -2.136521   .6199335    -3.45   0.001     -3.35311   -.9199317
         /dk |   2.267096   1.351729     1.68   0.094    -.3856059    4.919798
   /momentum |   188.0502          .        .       .            .           .
  /kispartok |   .4490342   .2729252     1.65   0.100    -.0865682    .9846366
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(193 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0211778       7.34e-06
 5%     .1212875       .0026125
10%     .2343248       .0044441       Obs                 950
25%      .619371       .0059973       Sum of wgt.         950

50%     1.302159                      Mean           1.594817
                        Largest       Std. dev.      1.334209
75%     2.176618       7.692268
90%     3.337319       7.701957       Variance       1.780115
95%     4.183076        8.41432       Skewness       1.588804
99%     6.319247       8.670715       Kurtosis       6.498014

Iteration 0:  Residual SS = 956881.9
Iteration 1:  Residual SS = 955999.4
Iteration 2:  Residual SS = 954573.4
Iteration 3:  Residual SS = 954334.5
Iteration 4:  Residual SS = 954293.8
Iteration 5:  Residual SS = 954287.6
Iteration 6:  Residual SS =   954287
Iteration 7:  Residual SS = 954286.9
Iteration 8:  Residual SS = 954286.9
Iteration 9:  Residual SS = 954286.9
Iteration 10: Residual SS = 954286.9
Iteration 11: Residual SS = 939071.8
Iteration 12: Residual SS = 933012.2
Iteration 13: Residual SS = 933011.1
Iteration 14: Residual SS = 933011.1
Iteration 15: Residual SS = 933011.1


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        960
       Model |   68138703          7  9734100.42    R-squared     =     0.9865
    Residual |  933011.05        953  979.025236    Adj R-squared =     0.9864
-------------+----------------------------------    Root MSE      =   31.28938
       Total |   69071714        960  71949.7021    Res. dev.     =   9328.431

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7664879    .203532    -3.77   0.000    -1.165911   -.3670652
   /mihazank |  -2.005701   2.650361    -0.76   0.449    -7.206919    3.195518
      /tisza |  -.6212145   .1015118    -6.12   0.000     -.820427    -.422002
        /lmp |   1.691966   .9080636     1.86   0.063    -.0900697    3.474001
     /fidesz |   1.472277   .2095173     7.03   0.000     1.061109    1.883446
         /dk |  -1.16e+08          .        .       .            .           .
   /momentum |  -1.083618   .4097893    -2.64   0.008    -1.887812   -.2794243
  /kispartok |  -.6820459   .3010458    -2.27   0.024    -1.272835   -.0912566
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(193 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0350346       .0005922
 5%     .1508139       .0024858
10%     .3009792       .0046589       Obs                 950
25%     .7380015       .0073677       Sum of wgt.         950

50%     1.453216                      Mean           1.775688
                        Largest       Std. dev.       1.54236
75%     2.478149       7.826499
90%     3.420895       9.612734       Variance       2.378873
95%     4.328173       15.79435       Skewness       3.715717
99%     6.250981       21.24167       Kurtosis       37.05129

Iteration 0:  Residual SS =  2745227
Iteration 1:  Residual SS = 316982.2
Iteration 2:  Residual SS = 100390.1
Iteration 3:  Residual SS = 61755.29
Iteration 4:  Residual SS = 52422.85
Iteration 5:  Residual SS = 52288.94
Iteration 6:  Residual SS = 49417.23
Iteration 7:  Residual SS = 48794.58
Iteration 8:  Residual SS = 48791.86
Iteration 9:  Residual SS = 48791.85
Iteration 10: Residual SS = 48791.85


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        960
       Model |  814394.15          4  203598.536    R-squared     =     0.9435
    Residual |  48791.855        956  51.0375048    Adj R-squared =     0.9432
-------------+----------------------------------    Root MSE      =   7.144054
       Total |     863186        960  899.152083    Res. dev.     =   6495.612

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.88e+08          .        .       .            .           .
   /mihazank |   1.741018   .3552658     4.90   0.000     1.043827    2.438209
      /tisza |  -21.36211          .        .       .            .           .
        /lmp |  -1.931553   .2500432    -7.72   0.000     -2.42225   -1.440856
     /fidesz |  -1.848054   .0805675   -22.94   0.000    -2.006164   -1.689944
         /dk |  -198.1525          .        .       .            .           .
   /momentum |  -426.3881          .        .       .            .           .
  /kispartok |  -1.809791    .273241    -6.62   0.000    -2.346012   -1.273569
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(193 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0215003       .0016583
 5%      .087506       .0017834
10%     .1541089       .0048677       Obs                 950
25%     .4049585       .0054014       Sum of wgt.         950

50%      .791036                      Mean           .9801747
                        Largest       Std. dev.      .8030964
75%     1.353605       4.588981
90%     2.020444       5.626967       Variance       .6449638
95%     2.472708       5.637172       Skewness       1.717853
99%     3.706357       5.995126       Kurtosis       7.949887

Iteration 0:  Residual SS =  2690286
Iteration 1:  Residual SS = 279816.4
Iteration 2:  Residual SS = 91215.07
Iteration 3:  Residual SS = 72372.75
Iteration 4:  Residual SS = 64035.94
Iteration 5:  Residual SS = 57283.69
Iteration 6:  Residual SS = 57092.02
Iteration 7:  Residual SS = 57088.82
Iteration 8:  Residual SS = 56815.71
Iteration 9:  Residual SS = 56815.56
Iteration 10: Residual SS = 56815.56


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        960
       Model |  298008.44          4  74502.1106    R-squared     =     0.8399
    Residual |  56815.558        956  59.4304997    Adj R-squared =     0.8392
-------------+----------------------------------    Root MSE      =   7.709118
       Total |     354824        960  369.608333    Res. dev.     =   6641.769

------------------------------------------------------------------------------
 ervenytelen | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   -1.87586   .1852073   -10.13   0.000     -2.23932   -1.512401
   /mihazank |  -1.679856     .33105    -5.07   0.000    -2.329525   -1.030187
      /tisza |  -8.138507          .        .       .            .           .
        /lmp |  -32.35153          .        .       .            .           .
     /fidesz |  -1.332193   .0355228   -37.50   0.000    -1.401904   -1.262481
         /dk |    -606681          .        .       .            .           .
   /momentum |  -4065.024          .        .       .            .           .
  /kispartok |  -2.057273   .4752776    -4.33   0.000    -2.989981   -1.124565
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(193 missing values generated)

                       ae_ervenytelen
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0110348        .000519
 5%     .0751959         .00336
10%     .1436286       .0050177       Obs                 950
25%     .3632603       .0066066       Sum of wgt.         950

50%      .789963                      Mean           1.073834
                        Largest       Std. dev.      1.246839
75%     1.390363       8.054585
90%     2.077455       9.240894       Variance       1.554608
95%     2.959855       9.994017       Skewness       5.542829
99%     5.419774       19.73814       Kurtosis       63.17693

. 
. * manually adjust models so that each party has a share between 0 and 1
. local karacsony0 fidesz lmp mihazank

. local karacsony1 dk momentum

. local vitezy0 dk

. local vitezy1 lmp

. 
. foreach jelolt in karacsony vitezy {
  2.     generate `jelolt'_minusz = `jelolt'
  3.     foreach one in ``jelolt'1' {
  4.         replace `jelolt'_minusz = `jelolt'_minusz - `one' if `jelolt' > 0
  5.     } 
  6. }
(949 real changes made)
(950 real changes made)
(950 real changes made)

. regress karacsony_minusz mkkp tisza kispartok if part_total>0, noconstant

      Source |       SS           df       MS      Number of obs   =       960
-------------+----------------------------------   F(3, 957)       =  17134.87
       Model |  20360143.1         3  6786714.37   Prob > F        =    0.0000
    Residual |  379044.895       957  396.076171   R-squared       =    0.9817
-------------+----------------------------------   Adj R-squared   =    0.9817
       Total |    20739188       960  21603.3208   Root MSE        =    19.902

------------------------------------------------------------------------------
karacsony_~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .8025194   .0336942    23.82   0.000     .7363963    .8686426
       tisza |   .6704188   .0100102    66.97   0.000     .6507745    .6900632
   kispartok |    .677676   .0586069    11.56   0.000     .5626632    .7926887
------------------------------------------------------------------------------

. regress vitezy_minusz mkkp mihazank tisza fidesz kispartok if part_total>0, n
> oconstant

      Source |       SS           df       MS      Number of obs   =       960
-------------+----------------------------------   F(5, 955)       =  13422.57
       Model |  41979126.8         5  8395825.36   Prob > F        =    0.0000
    Residual |  597353.201       955  625.500734   R-squared       =    0.9860
-------------+----------------------------------   Adj R-squared   =    0.9859
       Total |    42576480       960     44350.5   Root MSE        =     25.01

------------------------------------------------------------------------------
vitezy_min~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .2514782   .0447849     5.62   0.000     .1635901    .3393662
    mihazank |    .006923   .1100615     0.06   0.950    -.2090672    .2229132
       tisza |   .2819101   .0210034    13.42   0.000     .2406919    .3231282
      fidesz |   .9215705   .0216739    42.52   0.000     .8790365    .9641045
   kispartok |   .2485511   .0749391     3.32   0.001     .1014868    .3956154
------------------------------------------------------------------------------

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen" if index == 4
variable jelolt was str9 now str11
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
