
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum 

. local kispartok neppartjan munkaspart szolidaritas 

. local jeloltek karacsony vitezy grundtner ervenytelen 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. 
. local formula 0

. foreach part in `partok' kispartok {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS = 785085.9
Iteration 1:  Residual SS = 700799.6
Iteration 2:  Residual SS = 680701.5
Iteration 3:  Residual SS = 578833.7
Iteration 4:  Residual SS = 578831.6
Iteration 5:  Residual SS = 578831.5
Iteration 6:  Residual SS = 578831.5
Iteration 7:  Residual SS = 569660.4
Iteration 8:  Residual SS = 567916.2
Iteration 9:  Residual SS =   567916
Iteration 10: Residual SS =   567916


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        667
       Model |   44383500          4    11095875    R-squared     =     0.9874
    Residual |  567915.97        663  856.585177    Adj R-squared =     0.9873
-------------+----------------------------------    Root MSE      =   29.26748
       Total |   44951416        667  67393.4273    Res. dev.     =   6393.072

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .5784532    .174151     3.32   0.001     .2364992    .9204071
   /mihazank |   -64.1281          .        .       .            .           .
      /tisza |   .5128606   .0893205     5.74   0.000     .3374755    .6882457
        /lmp |  -11958.75          .        .       .            .           .
     /fidesz |  -1.84e+08          .        .       .            .           .
         /dk |   2.219923   1.349804     1.64   0.101    -.4304834    4.870329
   /momentum |    9.13465          .        .       .            .           .
  /kispartok |   .5242378   .2528028     2.07   0.038     .0278472    1.020628
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(377 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .024598       .0005222
 5%     .1128513       .0007909
10%     .2343433       .0145497       Obs                 661
25%     .6201384       .0159356       Sum of wgt.         661

50%     1.256149                      Mean           1.619374
                        Largest       Std. dev.      1.495688
75%      2.19506       7.230374
90%     3.360038       8.724539       Variance       2.237083
95%     4.291172        10.0745       Skewness        3.23857
99%     6.635334       18.11153       Kurtosis       27.36028

Iteration 0:  Residual SS = 605028.9
Iteration 1:  Residual SS = 602097.7
Iteration 2:  Residual SS =   600953
Iteration 3:  Residual SS = 600949.2
Iteration 4:  Residual SS = 600949.2
Iteration 5:  Residual SS = 600949.2
Iteration 6:  Residual SS =   571360
Iteration 7:  Residual SS = 571359.2
Iteration 8:  Residual SS = 571359.2
Iteration 9:  Residual SS = 571359.2


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        667
       Model |   44379353          7  6339907.54    R-squared     =     0.9873
    Residual |  571359.24        660  865.695814    Adj R-squared =     0.9872
-------------+----------------------------------    Root MSE      =   29.42271
       Total |   44950712        667  67392.3718    Res. dev.     =   6397.104

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.9756954   .2688753    -3.63   0.000     -1.50365   -.4477412
   /mihazank |  -1.388763   1.085879    -1.28   0.201    -3.520957    .7434316
      /tisza |  -.4088941   .1071827    -3.81   0.000    -.6193543   -.1984339
        /lmp |   1.276385   .5817304     2.19   0.029     .1341196     2.41865
     /fidesz |   1.261622   .1840899     6.85   0.000     .9001492    1.623094
         /dk |  -13.23339          .        .       .            .           .
   /momentum |  -1.357293   .6916423    -1.96   0.050    -2.715377    .0007916
  /kispartok |  -.5475822    .266062    -2.06   0.040    -1.070012   -.0251521
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(377 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0118981       .0022792
 5%     .1651704         .00235
10%     .3116255       .0059016       Obs                 661
25%     .7523199       .0075391       Sum of wgt.         661

50%     1.449317                      Mean           1.815594
                        Largest       Std. dev.      1.615331
75%     2.505289         12.142
90%     3.517399       12.88453       Variance       2.609295
95%     4.257115       13.34355       Skewness       3.427154
99%     6.510195       18.15808       Kurtosis       27.25697

Iteration 0:  Residual SS =  1764839
Iteration 1:  Residual SS = 206276.2
Iteration 2:  Residual SS = 68022.61
Iteration 3:  Residual SS = 40444.37
Iteration 4:  Residual SS = 31988.06
Iteration 5:  Residual SS = 31665.02
Iteration 6:  Residual SS = 31455.08
Iteration 7:  Residual SS = 30122.12
Iteration 8:  Residual SS = 30112.54
Iteration 9:  Residual SS = 30112.54
Iteration 10: Residual SS = 30112.54


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        667
       Model |  538347.46          4  134586.865    R-squared     =     0.9470
    Residual |  30112.541        663  45.4186136    Adj R-squared =     0.9467
-------------+----------------------------------    Root MSE      =   6.739333
       Total |     568460        667  852.263868    Res. dev.     =   4434.072

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -8.271684          .        .       .            .           .
   /mihazank |   1.725507   .4026033     4.29   0.000     .9349755    2.516038
      /tisza |  -42404.98          .        .       .            .           .
        /lmp |  -1.804665   .2357608    -7.65   0.000    -2.267593   -1.341738
     /fidesz |  -1.864622   .0990495   -18.83   0.000    -2.059111   -1.670134
         /dk |  -7.824706          .        .       .            .           .
   /momentum |  -396855.8          .        .       .            .           .
  /kispartok |  -1.990742   .3671581    -5.42   0.000    -2.711674   -1.269809
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(377 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0197335       .0002245
 5%     .0957489       .0004653
10%     .1710733        .009385       Obs                 661
25%     .4360445       .0100276       Sum of wgt.         661

50%     .7625342                      Mean           .9747023
                        Largest       Std. dev.      .8097565
75%     1.330294       4.530639
90%     1.974115       5.578021       Variance       .6557057
95%     2.498276       5.663827       Skewness       1.956255
99%     3.818096       6.040345       Kurtosis       9.356676

Iteration 0:  Residual SS =  1738050
Iteration 1:  Residual SS = 182375.7
Iteration 2:  Residual SS = 62945.74
Iteration 3:  Residual SS =  54266.6
Iteration 4:  Residual SS = 46201.62
Iteration 5:  Residual SS = 37115.03
Iteration 6:  Residual SS = 36890.88
Iteration 7:  Residual SS = 36887.35
Iteration 8:  Residual SS = 36887.35
Iteration 9:  Residual SS = 36887.35


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        667
       Model |  189437.65          5  37887.5305    R-squared     =     0.8370
    Residual |  36887.348        662  55.7210689    Adj R-squared =     0.8358
-------------+----------------------------------    Root MSE      =   7.464655
       Total |     226325        667  339.317841    Res. dev.     =   4569.424

------------------------------------------------------------------------------
 ervenytelen | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.812932   .1950192    -9.30   0.000    -2.195863   -1.430002
   /mihazank |  -1.558689   .3418605    -4.56   0.000    -2.229951   -.8874275
      /tisza |  -433.1845          .        .       .            .           .
        /lmp |  -26.89344          .        .       .            .           .
     /fidesz |  -1.383482   .0484464   -28.56   0.000    -1.478609   -1.288355
         /dk |  -2.469845   .5163712    -4.78   0.000    -3.483768   -1.455922
   /momentum |  -13.26363          .        .       .            .           .
  /kispartok |  -2.168569   .5879154    -3.69   0.000    -3.322973   -1.014166
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(377 missing values generated)

                       ae_ervenytelen
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0162057       .0013737
 5%     .0684165       .0020836
10%     .1408181       .0020878       Obs                 661
25%     .3687702       .0033322       Sum of wgt.         661

50%     .8014862                      Mean           1.094754
                        Largest       Std. dev.      1.374032
75%     1.373758       8.275206
90%     2.085968        9.57856       Variance       1.887964
95%     3.020049       10.28048       Skewness       6.069912
99%     6.393674       20.19979       Kurtosis       66.86875

. 
. * manually adjust models so that each party has a share between 0 and 1
. local karacsony0 fidesz lmp mihazank

. local karacsony1 dk momentum

. local vitezy0 dk

. local vitezy1 lmp

. 
. foreach jelolt in karacsony vitezy {
  2.     generate `jelolt'_minusz = `jelolt'
  3.     foreach one in ``jelolt'1' {
  4.         replace `jelolt'_minusz = `jelolt'_minusz - `one' if `jelolt' > 0
  5.     } 
  6. }
(660 real changes made)
(661 real changes made)
(661 real changes made)

. regress karacsony_minusz mkkp tisza kispartok if part_total>0, noconstant

      Source |       SS           df       MS      Number of obs   =       667
-------------+----------------------------------   F(3, 664)       =  13165.77
       Model |  13278992.3         3  4426330.77   Prob > F        =    0.0000
    Residual |  223236.692       664  336.199837   R-squared       =    0.9835
-------------+----------------------------------   Adj R-squared   =    0.9834
       Total |    13502229       667  20243.2219   Root MSE        =    18.336

------------------------------------------------------------------------------
karacsony_~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .7559429   .0367543    20.57   0.000     .6837743    .8281115
       tisza |   .6857602    .011168    61.40   0.000     .6638313    .7076891
   kispartok |   .6902322   .0546339    12.63   0.000     .5829561    .7975082
------------------------------------------------------------------------------

. regress vitezy_minusz mkkp mihazank tisza fidesz kispartok if part_total>0, n
> oconstant

      Source |       SS           df       MS      Number of obs   =       667
-------------+----------------------------------   F(5, 662)       =   9578.66
       Model |  27440830.2         5  5488166.04   Prob > F        =    0.0000
    Residual |  379297.822       662  572.957434   R-squared       =    0.9864
-------------+----------------------------------   Adj R-squared   =    0.9863
       Total |    27820128       667  41709.3373   Root MSE        =    23.937

------------------------------------------------------------------------------
vitezy_min~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .1966353   .0504124     3.90   0.000     .0976478    .2956228
    mihazank |   .0513276   .1313324     0.39   0.696    -.2065507    .3092059
       tisza |   .3244081   .0254982    12.72   0.000      .274341    .3744752
      fidesz |   .8915105   .0256458    34.76   0.000     .8411535    .9418674
   kispartok |   .2764428   .0727479     3.80   0.000     .1335985    .4192872
------------------------------------------------------------------------------

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok'

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen" if index == 4
variable jelolt was str9 now str11
(1 real change made)

. 
. foreach part in `partok' {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)

. 
. list jelolt `partok'

     +--------------------------------------------------------------------+
  1. |      jelolt |     mkkp | mihazank |    tisza |      lmp |   fidesz |
     |   karacsony | 20418.21 |        0 | 68245.98 |        0 |        0 |
     |--------------------------------------------------------------------|
     |                  dk             |             momentum             |
     |            58031.03             |                17248             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |      jelolt |     mkkp | mihazank |    tisza |      lmp |   fidesz |
     |      vitezy | 4677.658 | 1159.034 | 33468.05 | 32655.86 | 93306.88 |
     |--------------------------------------------------------------------|
     |                  dk             |             momentum             |
     |            1.66e-35             |             1506.511             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |      jelolt |     mkkp | mihazank |    tisza |      lmp |   fidesz |
     |   grundtner | 1.88e-12 | 13463.54 |        0 | 1291.703 | 3238.801 |
     |--------------------------------------------------------------------|
     |                  dk             |             momentum             |
     |            1.50e-10             |                    0             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |      jelolt |     mkkp | mihazank |    tisza |      lmp |   fidesz |
     | ervenytelen | 992.3537 | 836.8835 |        0 |        0 |  8665.89 |
     |--------------------------------------------------------------------|
     |                  dk             |             momentum             |
     |            397.4587             |             3.24e-36             |
     +--------------------------------------------------------------------+

. 
end of do-file
