
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum neppartjan munkaspart
>  szolidaritas ervenytelen

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0 & `jelolt'>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS = 436946.8
Iteration 1:  Residual SS = 226964.4
Iteration 2:  Residual SS = 182262.8
Iteration 3:  Residual SS = 140897.2
Iteration 4:  Residual SS = 133011.1
Iteration 5:  Residual SS = 133007.7
Iteration 6:  Residual SS = 133007.7
Iteration 7:  Residual SS = 133007.7


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,184
       Model |   91881909          6  15313651.5    R-squared     =     0.9986
    Residual |  133007.74       1178  112.909796    Adj R-squared =     0.9985
-------------+----------------------------------    Root MSE      =    10.6259
       Total |   92014917       1184  77715.3015    Res. dev.     =   8950.313

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .7858854   .0613561    12.81   0.000      .665506    .9062648
   /mihazank |  -113.8547          .        .       .            .           .
      /tisza |   .4306867   .0168664    25.54   0.000     .3975951    .4637783
        /lmp |  -11.15724          .        .       .            .           .
     /fidesz |  -1.95e+08          .        .       .            .           .
         /dk |    19909.8          .        .       .            .           .
   /momentum |   1.979546    .479681     4.13   0.000     1.038422    2.920671
 /neppartjan |  -3963.951          .        .       .            .           .
 /munkaspart |   .3996743   .0931627     4.29   0.000     .2168909    .5824577
/szolidari~s |   .8094545   .3292857     2.46   0.014     .1634026    1.455506
/ervenytelen |  -.0268544    .110486    -0.24   0.808    -.2436257    .1899169
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(70 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0244442       .0010906
 5%     .1157757       .0058108
10%     .2239378       .0065604       Obs               1,184
25%     .6007366       .0071018       Sum of wgt.       1,184

50%     1.229612                      Mean           1.489626
                        Largest       Std. dev.      1.199969
75%     2.086087         6.4134
90%     3.070339        6.78918       Variance       1.439926
95%     3.829357       7.470266       Skewness       1.352464
99%     5.369733       7.811483       Kurtosis       5.340774

Iteration 0:  Residual SS = 191334.2
Iteration 1:  Residual SS =   178883
Iteration 2:  Residual SS = 177475.5
Iteration 3:  Residual SS = 177462.4
Iteration 4:  Residual SS = 177460.4
Iteration 5:  Residual SS = 177460.1
Iteration 6:  Residual SS = 177460.1
Iteration 7:  Residual SS = 177460.1
Iteration 8:  Residual SS = 177460.1
Iteration 9:  Residual SS = 177460.1
Iteration 10: Residual SS = 177460.1
Iteration 11: Residual SS = 174407.3
Iteration 12: Residual SS = 162289.2
Iteration 13: Residual SS = 162092.1
Iteration 14: Residual SS = 162085.2
Iteration 15: Residual SS = 162085.1
Iteration 16: Residual SS = 162085.1
Iteration 17: Residual SS = 162085.1


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,184
       Model |   90904476          8  11363059.5    R-squared     =     0.9982
    Residual |   162085.1       1176  137.827463    Adj R-squared =     0.9982
-------------+----------------------------------    Root MSE      =   11.73999
       Total |   91066561       1184  76914.3252    Res. dev.     =   9184.406

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7285873   .0677126   -10.76   0.000    -.8614382   -.5957363
   /mihazank |  -1.321521   .2779243    -4.75   0.000    -1.866804   -.7762386
      /tisza |  -.5171543   .0271828   -19.03   0.000    -.5704864   -.4638221
        /lmp |   24.55204          .        .       .            .           .
     /fidesz |   1.265107   .0525502    24.07   0.000     1.162005     1.36821
         /dk |  -8.44e+07          .        .       .            .           .
   /momentum |  -1.898978   .4574366    -4.15   0.000    -2.796461   -1.001495
 /neppartjan |  -239036.9          .        .       .            .           .
 /munkaspart |  -.5844834   .1138015    -5.14   0.000      -.80776   -.3612068
/szolidari~s |  -1.465879   .7685378    -1.91   0.057    -2.973737    .0419791
/ervenytelen |  -.7398803   .1673776    -4.42   0.000    -1.068272   -.4114882
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(70 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0154314       .0021302
 5%     .1468168       .0022758
10%     .2580846       .0054371       Obs               1,184
25%      .671811       .0058364       Sum of wgt.       1,184

50%     1.385867                      Mean           1.694098
                        Largest       Std. dev.      1.487744
75%     2.322402        8.33905
90%     3.492399       9.085985       Variance       2.213383
95%     4.235808       15.13297       Skewness       3.598461
99%     6.096699       21.85026       Kurtosis       37.42394

Iteration 0:  Residual SS =  3692805
Iteration 1:  Residual SS = 401082.5
Iteration 2:  Residual SS = 104439.1
Iteration 3:  Residual SS = 69154.33
Iteration 4:  Residual SS =  51633.8
Iteration 5:  Residual SS = 50501.25
Iteration 6:  Residual SS = 46410.81
Iteration 7:  Residual SS = 45347.48
Iteration 8:  Residual SS = 45343.55
Iteration 9:  Residual SS = 45343.55
Iteration 10: Residual SS = 45343.55


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,184
       Model |  1052803.5          6  175467.242    R-squared     =     0.9587
    Residual |  45343.548       1178  38.4919759    Adj R-squared =     0.9585
-------------+----------------------------------    Root MSE      =    6.20419
       Total |    1098147       1184   927.48902    Res. dev.     =   7676.164

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -3.55e+08          .        .       .            .           .
   /mihazank |   1.436376   .1679945     8.55   0.000     1.106774    1.765977
      /tisza |  -28.18092          .        .       .            .           .
        /lmp |  -1.829761   .1582682   -11.56   0.000     -2.14028   -1.519242
     /fidesz |  -2.045004   .0936648   -21.83   0.000    -2.228773   -1.861236
         /dk |  -586.2371          .        .       .            .           .
   /momentum |  -12.76303          .        .       .            .           .
 /neppartjan |   76213.48          .        .       .            .           .
 /munkaspart |  -2.234403   .6081952    -3.67   0.000     -3.42767   -1.041137
/szolidari~s |  -1.417049   .3784553    -3.74   0.000    -2.159571    -.674527
/ervenytelen |  -.9642441   .1061733    -9.08   0.000    -1.172554   -.7559343
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(70 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0222172       .0016769
 5%     .0863846       .0044096
10%     .1700562       .0056207       Obs               1,184
25%     .3851333       .0064439       Sum of wgt.       1,184

50%     .7365982                      Mean           .9138897
                        Largest       Std. dev.      .7352927
75%     1.246127       4.069093
90%     1.891464       4.548191       Variance       .5406554
95%     2.315019       4.990358       Skewness       1.682035
99%     3.466836        6.31094       Kurtosis       7.863917

Iteration 0:  Residual SS =  3723981
Iteration 1:  Residual SS = 385063.7
Iteration 2:  Residual SS = 113483.2
Iteration 3:  Residual SS = 84250.18
Iteration 4:  Residual SS = 68846.55
Iteration 5:  Residual SS = 67576.62
Iteration 6:  Residual SS = 58024.69
Iteration 7:  Residual SS = 57736.91
Iteration 8:  Residual SS = 57721.52
Iteration 9:  Residual SS = 57721.18
Iteration 10: Residual SS = 57713.51
Iteration 11: Residual SS = 57713.51
Iteration 12: Residual SS = 57713.51


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,184
       Model |  396985.49          6   66164.248    R-squared     =     0.8731
    Residual |  57713.512       1178  48.9927943    Adj R-squared =     0.8724
-------------+----------------------------------    Root MSE      =   6.999485
       Total |     454699       1184  384.036318    Res. dev.     =   7961.772

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.666266   .1055231   -15.79   0.000      -1.8733   -1.459231
   /mihazank |  -2.099931   .5889448    -3.57   0.000    -3.255428   -.9444329
      /tisza |  -3.94e+07          .        .       .            .           .
        /lmp |  -3381.378          .        .       .            .           .
     /fidesz |  -1.535406   .0412432   -37.23   0.000    -1.616325   -1.454488
         /dk |  -53.56511          .        .       .            .           .
   /momentum |  -133.4406          .        .       .            .           .
 /neppartjan |   22.66314          .        .       .            .           .
 /munkaspart |     -2.318   .8288877    -2.80   0.005    -3.944261   -.6917389
/szolidari~s |  -1.540675   .5122062    -3.01   0.003    -2.545613   -.5357367
/ervenytelen |  -.2775658   .0778256    -3.57   0.000    -.4302581   -.1248735
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(70 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0165342       .0000391
 5%     .0654365       .0018915
10%     .1210849       .0047496       Obs               1,184
25%     .3392543       .0054449       Sum of wgt.       1,184

50%     .7331704                      Mean           .9780759
                        Largest       Std. dev.      1.070845
75%     1.294093       7.237794
90%     1.950435       7.939867       Variance       1.146708
95%     2.605368       8.434995       Skewness       5.476413
99%     5.023876       18.38924       Kurtosis        68.2554

. 
. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
