
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum kispartok 

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     regress `jelolt' `partok' if part_total>0, noconstant robust
  3.     nl (`jelolt' = `formula') if part_total>0, noconstant
  4.     foreach part in `partok' {
  5.         scalar `jelolt'_`part' = normal(_b[/`part'])
  6.         *generate `jelolt'_X_`part' = `jelolt'_`part' * `part'
.     }
  7.     predict `jelolt'_predict
  8.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  9.     scatter `jelolt' `jelolt'_predict, msize(tiny)
 10. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 11.     scalar hiba_`jelolt' = r(mean)
 12. }

Linear regression                               Number of obs     =      1,354
                                                F(8, 1346)        >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9986
                                                Root MSE          =     10.813

------------------------------------------------------------------------------
             |               Robust
   karacsony | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .7854948   .0180701    43.47   0.000     .7500462    .8209435
    mihazank |  -.2021124   .0482557    -4.19   0.000     -.296777   -.1074479
       tisza |   .7104238   .0114172    62.22   0.000     .6880264    .7328212
         lmp |  -.1063512   .0247917    -4.29   0.000    -.1549857   -.0577166
      fidesz |   .0126173    .008592     1.47   0.142    -.0042379    .0294724
          dk |   1.071789   .0151675    70.66   0.000     1.042034    1.101543
    momentum |   .9386172   .0231409    40.56   0.000     .8932211    .9840134
   kispartok |   .5959931   .2511045     2.37   0.018     .1033943    1.088592
------------------------------------------------------------------------------

Iteration 0:  Residual SS =   439422
Iteration 1:  Residual SS = 250106.4
Iteration 2:  Residual SS = 201200.8
Iteration 3:  Residual SS = 172268.1
Iteration 4:  Residual SS =   170076
Iteration 5:  Residual SS =   170050
Iteration 6:  Residual SS = 166285.9
Iteration 7:  Residual SS = 166285.8
Iteration 8:  Residual SS = 166285.8
Iteration 9:  Residual SS = 166285.8
Iteration 10: Residual SS = 166285.8


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1.097e+08          4  27423896.1    R-squared     =     0.9985
    Residual |  166285.78       1350  123.174651    Adj R-squared =     0.9985
-------------+----------------------------------    Root MSE      =   11.09841
       Total |  1.099e+08       1354  81138.7518    Res. dev.     =    10356.1

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .8275179   .0627617    13.19   0.000     .7043968    .9506389
   /mihazank |  -22881.31          .        .       .            .           .
      /tisza |   .5140417   .0161258    31.88   0.000     .4824074    .5456759
        /lmp |  -19.27827          .        .       .            .           .
     /fidesz |  -67.92215          .        .       .            .           .
         /dk |   1.34e+07          .        .       .            .           .
   /momentum |   1.681657   .2684747     6.26   0.000     1.154984     2.20833
  /kispartok |   .0100515   .1999365     0.05   0.960    -.3821685    .4022714
------------------------------------------------------------------------------
(option yhat assumed; fitted values)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0229412       .0013725
 5%     .1116363       .0072128
10%     .2302276       .0108461       Obs               1,354
25%      .582724       .0109397       Sum of wgt.       1,354

50%     1.212771                      Mean           1.508218
                        Largest       Std. dev.      1.254284
75%     2.088162       7.401563
90%     3.147195        8.06742       Variance       1.573229
95%     3.991769       8.070304       Skewness         1.5973
99%     5.809659       8.765491       Kurtosis        6.69606

Linear regression                               Number of obs     =      1,354
                                                F(8, 1346)        =   89341.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9982
                                                Root MSE          =     11.938

------------------------------------------------------------------------------
             |               Robust
      vitezy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .2256131   .0189724    11.89   0.000     .1883945    .2628318
    mihazank |   .0961109   .0473053     2.03   0.042     .0033107     .188911
       tisza |   .3192318   .0119178    26.79   0.000     .2958524    .3426113
         lmp |   1.081372   .0286704    37.72   0.000     1.025129    1.137616
      fidesz |   .9173026   .0096205    95.35   0.000     .8984298    .9361755
          dk |  -.0669545   .0149954    -4.46   0.000    -.0963715   -.0375375
    momentum |   .0059879   .0247855     0.24   0.809    -.0426346    .0546104
   kispartok |  -.2764659   .2263547    -1.22   0.222    -.7205123    .1675804
------------------------------------------------------------------------------

Iteration 0:  Residual SS = 226319.5
Iteration 1:  Residual SS = 207359.6
Iteration 2:  Residual SS = 203630.1
Iteration 3:  Residual SS = 203630.1
Iteration 4:  Residual SS = 203630.1
Iteration 5:  Residual SS = 203630.1
Iteration 6:  Residual SS = 203630.1
Iteration 7:  Residual SS = 203630.1
Iteration 8:  Residual SS = 197644.9
Iteration 9:  Residual SS = 197638.1
Iteration 10: Residual SS = 197638.1
Iteration 11: Residual SS = 197638.1


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1.077e+08          5  21534625.6    R-squared     =     0.9982
    Residual |  197638.13       1349  146.507139    Adj R-squared =     0.9982
-------------+----------------------------------    Root MSE      =   12.10401
       Total |  1.079e+08       1354  79668.2171    Res. dev.     =   10589.97

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7667676   .0682832   -11.23   0.000    -.9007205   -.6328147
   /mihazank |  -1.485886   .3309302    -4.49   0.000     -2.13508   -.8366928
      /tisza |  -.5017462   .0255871   -19.61   0.000     -.551941   -.4515514
        /lmp |   8.234982          .        .       .            .           .
     /fidesz |   1.390921   .0565424    24.60   0.000         1.28    1.501841
         /dk |  -7.737415          .        .       .            .           .
   /momentum |  -2.352991   1.139069    -2.07   0.039    -4.587529   -.1184521
  /kispartok |   -6.64955          .        .       .            .           .
------------------------------------------------------------------------------
(option yhat assumed; fitted values)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0127609       .0001216
 5%     .1223648       .0002249
10%     .2286044       .0010827       Obs               1,354
25%     .6407496       .0012037       Sum of wgt.       1,354

50%     1.414412                      Mean           1.706937
                        Largest       Std. dev.      1.503487
75%     2.294996       9.081636
90%     3.548748       10.39745       Variance       2.260472
95%     4.426693       15.56493       Skewness       3.082172
99%     6.239846       20.62481       Kurtosis       27.94446

Linear regression                               Number of obs     =      1,354
                                                F(8, 1346)        =    3557.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9587
                                                Root MSE          =     6.1979

------------------------------------------------------------------------------
             |               Robust
   grundtner | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |  -.0747338   .0102212    -7.31   0.000    -.0947851   -.0546825
    mihazank |   .8892932   .0269154    33.04   0.000     .8364925    .9420939
       tisza |    .004275   .0060619     0.71   0.481    -.0076167    .0161668
         lmp |   .0599275   .0152154     3.94   0.000      .030079     .089776
      fidesz |    .040696   .0047291     8.61   0.000     .0314187    .0499733
          dk |   .0124247   .0071869     1.73   0.084     -.001674    .0265235
    momentum |  -.0375323   .0137651    -2.73   0.006    -.0645356   -.0105289
   kispartok |   .2800571   .1294219     2.16   0.031     .0261666    .5339476
------------------------------------------------------------------------------

Iteration 0:  Residual SS =  4229736
Iteration 1:  Residual SS =   465100
Iteration 2:  Residual SS = 128246.9
Iteration 3:  Residual SS = 128246.9
Iteration 4:  Residual SS =  90853.1
Iteration 5:  Residual SS = 61030.66
Iteration 6:  Residual SS = 59551.22
Iteration 7:  Residual SS = 55181.43
Iteration 8:  Residual SS =  55099.7
Iteration 9:  Residual SS = 55098.61
Iteration 10: Residual SS = 55098.61
Iteration 11: Residual SS = 55098.61


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1196323.4          5  239264.678    R-squared     =     0.9560
    Residual |  55098.609       1349  40.8440393    Adj R-squared =     0.9558
-------------+----------------------------------    Root MSE      =   6.390934
       Total |    1251422       1354  924.240768    Res. dev.     =   8860.493

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.36e+07          .        .       .            .           .
   /mihazank |   1.558079   .1954457     7.97   0.000     1.174669     1.94149
      /tisza |  -13.11544          .        .       .            .           .
        /lmp |  -1.779699   .1588953   -11.20   0.000    -2.091408    -1.46799
     /fidesz |  -1.959261   .0735155   -26.65   0.000    -2.103478   -1.815044
         /dk |   -2.89407   1.020025    -2.84   0.005    -4.895077   -.8930628
   /momentum |  -39.75671          .        .       .            .           .
  /kispartok |  -.5162896   .1348183    -3.83   0.000    -.7807658   -.2518133
------------------------------------------------------------------------------
(option yhat assumed; fitted values)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0131776        .000867
 5%     .0662333       .0012181
10%     .1588469       .0012635       Obs               1,354
25%     .3878385       .0049841       Sum of wgt.       1,354

50%     .7442473                      Mean           .9278825
                        Largest       Std. dev.      .7643972
75%     1.305221       4.588116
90%     1.897377        5.40132       Variance       .5843031
95%      2.40751       5.493029       Skewness       1.736854
99%     3.437833       6.464808       Kurtosis       8.230862

Linear regression                               Number of obs     =      1,354
                                                F(8, 1346)        =     918.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8438
                                                Root MSE          =     7.9153

------------------------------------------------------------------------------
             |               Robust
ervenytele~o | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .0519166    .013118     3.96   0.000     .0261828    .0776505
    mihazank |   .0731678   .0331168     2.21   0.027     .0082016     .138134
       tisza |   -.005235   .0075769    -0.69   0.490    -.0200989    .0096288
         lmp |  -.0438121   .0177664    -2.47   0.014     -.078665   -.0089593
      fidesz |   .0876239   .0061696    14.20   0.000     .0755208    .0997269
          dk |     .01813   .0092646     1.96   0.051    -.0000448    .0363047
    momentum |  -.0042519    .016521    -0.26   0.797    -.0366617    .0281578
   kispartok |   .3029761   .1907485     1.59   0.112    -.0712207    .6771728
------------------------------------------------------------------------------

Iteration 0:  Residual SS =  4128929
Iteration 1:  Residual SS = 416182.3
Iteration 2:  Residual SS = 133765.8
Iteration 3:  Residual SS = 106342.7
Iteration 4:  Residual SS =  92229.3
Iteration 5:  Residual SS = 91782.23
Iteration 6:  Residual SS = 85052.48
Iteration 7:  Residual SS = 84953.88
Iteration 8:  Residual SS = 84952.98
Iteration 9:  Residual SS = 84952.98
Iteration 10: Residual SS = 84952.98


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  454991.02          5  90998.2046    R-squared     =     0.8427
    Residual |  84952.977       1349  62.9747793    Adj R-squared =     0.8421
-------------+----------------------------------    Root MSE      =   7.935665
       Total |     539944       1354  398.776957    Res. dev.     =   9446.739

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   -1.73382   .1327808   -13.06   0.000    -1.994299   -1.473341
   /mihazank |  -1.643129   .2762869    -5.95   0.000    -2.185128   -1.101131
      /tisza |   -2434134          .        .       .            .           .
        /lmp |  -147.1187          .        .       .            .           .
     /fidesz |   -1.40513   .0357172   -39.34   0.000    -1.475197   -1.335062
         /dk |  -2.557693   .4645984    -5.51   0.000    -3.469107   -1.646279
   /momentum |  -53.91524          .        .       .            .           .
  /kispartok |  -.5293032   .1685632    -3.14   0.002    -.8599778   -.1986287
------------------------------------------------------------------------------
(option yhat assumed; fitted values)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%       .02057       .0008978
 5%     .0788285         .00183
10%     .1479884       .0025484       Obs               1,354
25%     .3907665       .0054133       Sum of wgt.       1,354

50%     .8053475                      Mean           1.082071
                        Largest       Std. dev.      1.199892
75%     1.384361       8.447628
90%     2.158843       9.782578       Variance       1.439741
95%     3.131855        9.94051       Skewness       5.028547
99%     5.537375       19.84664       Kurtosis       55.67539

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok'

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
(file data/2024/budapest_becsles.csv not found)
file data/2024/budapest_becsles.csv saved

. 
end of do-file
