
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum kispartok ervenytelen

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS =  1150065
Iteration 1:  Residual SS = 988102.6
Iteration 2:  Residual SS = 965238.4
Iteration 3:  Residual SS = 959289.7
Iteration 4:  Residual SS = 951405.5
Iteration 5:  Residual SS =   947353
Iteration 6:  Residual SS = 947352.8
Iteration 7:  Residual SS = 947352.8


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,011
       Model |   73449614          4  18362403.5    R-squared     =     0.9873
    Residual |  947352.81       1007  940.767438    Adj R-squared =     0.9872
-------------+----------------------------------    Root MSE      =   30.67193
       Total |   74396967       1011  73587.5045    Res. dev.     =   9787.095

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .8767104   .1878311     4.67   0.000     .5081251    1.245296
   /mihazank |  -2013.518          .        .       .            .           .
      /tisza |    .322348   .0447695     7.20   0.000     .2344957    .4102003
        /lmp |  -197088.7          .        .       .            .           .
     /fidesz |  -11.71492          .        .       .            .           .
         /dk |   2509.521          .        .       .            .           .
   /momentum |   29.70357          .        .       .            .           .
  /kispartok |   .4314681   .2482674     1.74   0.083    -.0557127    .9186489
/ervenytelen |   .2237349   .3605358     0.62   0.535    -.4837526    .9312224
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(174 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0271884       .0006381
 5%     .1249615       .0024355
10%     .2226815       .0029568       Obs               1,002
25%     .5905361       .0057112       Sum of wgt.       1,002

50%     1.271879                      Mean           1.532325
                        Largest       Std. dev.      1.235902
75%     2.116626       6.311681
90%     3.276571       6.851128       Variance       1.527454
95%     3.989124       7.243209       Skewness       1.286075
99%       5.4581       7.580001       Kurtosis       4.920794

Iteration 0:  Residual SS = 892106.1
Iteration 1:  Residual SS = 875649.3
Iteration 2:  Residual SS = 874800.9
Iteration 3:  Residual SS = 874800.9
Iteration 4:  Residual SS = 874800.9
Iteration 5:  Residual SS = 874800.9
Iteration 6:  Residual SS = 874800.9
Iteration 7:  Residual SS = 874800.9
Iteration 8:  Residual SS = 874800.9
Iteration 9:  Residual SS = 874800.9
Iteration 10: Residual SS = 874800.9
Iteration 11: Residual SS = 874800.9
Iteration 12: Residual SS = 874800.9
Iteration 13: Residual SS = 874800.9
Iteration 14: Residual SS = 874800.9
Iteration 15: Residual SS = 874800.9
Iteration 16: Residual SS = 874800.9
Iteration 17: Residual SS = 874193.8
Iteration 18: Residual SS = 874193.8
Iteration 19: Residual SS = 874193.8


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,011
       Model |   72716595          7    10388085    R-squared     =     0.9881
    Residual |  874193.76       1004  870.710916    Adj R-squared =     0.9880
-------------+----------------------------------    Root MSE      =   29.50781
       Total |   73590789       1011  72790.0979    Res. dev.     =   9705.842

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7146876   .1812784    -3.94   0.000    -1.070416   -.3589597
   /mihazank |  -.9963175   .5228509    -1.91   0.057    -2.022323    .0296884
      /tisza |  -.6796564    .082391    -8.25   0.000    -.8413346   -.5179782
        /lmp |   10.15093          .        .       .            .           .
     /fidesz |   1.244211   .1409811     8.83   0.000     .9675592    1.520862
         /dk |  -8.471758          .        .       .            .           .
   /momentum |  -1.137749   .3991881    -2.85   0.004    -1.921088   -.3544105
  /kispartok |  -.7254274   .2884462    -2.51   0.012    -1.291454    -.159401
/ervenytelen |  -.3632716   .3786635    -0.96   0.338    -1.106334     .379791
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(174 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0331475       .0002771
 5%     .1559466       .0007209
10%     .3164158       .0012874       Obs               1,002
25%     .7084094       .0054363       Sum of wgt.       1,002

50%     1.399345                      Mean           1.736213
                        Largest       Std. dev.      1.531771
75%     2.396177       8.106599
90%     3.387631       9.980566       Variance       2.346324
95%     4.113203       15.24386       Skewness       4.267166
99%     5.924709        23.2481       Kurtosis       48.19481

Iteration 0:  Residual SS =  3031219
Iteration 1:  Residual SS = 351344.3
Iteration 2:  Residual SS = 106813.1
Iteration 3:  Residual SS = 74200.66
Iteration 4:  Residual SS =  56455.3
Iteration 5:  Residual SS =  56092.9
Iteration 6:  Residual SS = 48157.21
Iteration 7:  Residual SS = 48012.85
Iteration 8:  Residual SS = 48012.48
Iteration 9:  Residual SS = 48012.48
Iteration 10: Residual SS = 48012.48


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,011
       Model |  872000.52          5  174400.103    R-squared     =     0.9478
    Residual |  48012.484       1006   47.726127    Adj R-squared =     0.9476
-------------+----------------------------------    Root MSE      =    6.90841
       Total |     920013       1011  910.002967    Res. dev.     =   6772.081

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -4.02e+08          .        .       .            .           .
   /mihazank |    1.90574   .4501037     4.23   0.000      1.02249    2.788989
      /tisza |  -2047.082          .        .       .            .           .
        /lmp |  -1.861914   .2071881    -8.99   0.000    -2.268484   -1.455344
     /fidesz |  -2.035956   .1123202   -18.13   0.000    -2.256365   -1.815548
         /dk |  -3.22e+09          .        .       .            .           .
   /momentum |  -66.22119          .        .       .            .           .
  /kispartok |  -1.784421   .2521829    -7.08   0.000    -2.279285   -1.289556
/ervenytelen |  -1.040814   .1416744    -7.35   0.000    -1.318825   -.7628027
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(174 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0202861       .0021216
 5%     .0747036       .0032776
10%     .1470506        .003507       Obs               1,002
25%     .3949835       .0049942       Sum of wgt.       1,002

50%     .7728629                      Mean           .9556562
                        Largest       Std. dev.      .7737287
75%      1.28716       4.396824
90%     1.972948       4.634833       Variance       .5986561
95%     2.445801       4.949488       Skewness       1.595537
99%     3.489767       6.167407       Kurtosis       7.214052

Iteration 0:  Residual SS =  3054866
Iteration 1:  Residual SS = 320404.4
Iteration 2:  Residual SS = 96170.09
Iteration 3:  Residual SS = 73207.87
Iteration 4:  Residual SS = 63178.84
Iteration 5:  Residual SS = 55250.26
Iteration 6:  Residual SS = 51966.87
Iteration 7:  Residual SS = 51917.03
Iteration 8:  Residual SS = 51793.93
Iteration 9:  Residual SS = 51793.82
Iteration 10: Residual SS = 51793.82


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,011
       Model |  321933.18          5  64386.6354    R-squared     =     0.8614
    Residual |  51793.823       1006  51.4849136    Adj R-squared =     0.8607
-------------+----------------------------------    Root MSE      =   7.175299
       Total |     373727       1011  369.660732    Res. dev.     =   6848.724

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.840606   .1585083   -11.61   0.000    -2.151651   -1.529561
   /mihazank |  -1.526221   .2328766    -6.55   0.000      -1.9832   -1.069241
      /tisza |   -16.4021          .        .       .            .           .
        /lmp |  -96.03162          .        .       .            .           .
     /fidesz |  -1.525655   .0451305   -33.81   0.000    -1.614216   -1.437094
         /dk |   -785.343          .        .       .            .           .
   /momentum |  -2047.365          .        .       .            .           .
  /kispartok |   -1.95126   .3572946    -5.46   0.000    -2.652388   -1.250132
/ervenytelen |   -.202865   .0870272    -2.33   0.020    -.3736406   -.0320894
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(174 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0117258       .0011722
 5%     .0699662       .0058061
10%     .1308172       .0061063       Obs               1,002
25%      .343352       .0067353       Sum of wgt.       1,002

50%     .7382261                      Mean           .9922449
                        Largest       Std. dev.      1.109466
75%     1.281591       6.945505
90%     2.018121       8.009225       Variance       1.230914
95%     2.638983       8.161756       Skewness       5.330901
99%     4.954504       17.84253       Kurtosis       61.83468

. 
. * manually adjust models so that each party has a share between 0 and 1
. local karacsony0 fidesz lmp mihazank

. local karacsony1 dk momentum

. local vitezy0 dk

. local vitezy1 lmp

. 
. foreach jelolt in karacsony vitezy {
  2.     generate `jelolt'_minusz = `jelolt'
  3.     foreach one in ``jelolt'1' {
  4.         replace `jelolt'_minusz = `jelolt'_minusz - `one' if `jelolt' > 0
  5.     } 
  6. }
(1,001 real changes made)
(1,002 real changes made)
(1,002 real changes made)

. regress karacsony_minusz mkkp tisza kispartok if part_total>0, noconstant

      Source |       SS           df       MS      Number of obs   =     1,011
-------------+----------------------------------   F(3, 1008)      =  19482.19
       Model |  21637079.7         3  7212359.91   Prob > F        =    0.0000
    Residual |   373164.26     1,008  370.202639   R-squared       =    0.9830
-------------+----------------------------------   Adj R-squared   =    0.9830
       Total |    22010244     1,011  21770.7656   Root MSE        =    19.241

------------------------------------------------------------------------------
karacsony_~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .8083853   .0319763    25.28   0.000     .7456375    .8711331
       tisza |   .6702498   .0095052    70.51   0.000     .6515976    .6889021
   kispartok |   .6777849   .0565654    11.98   0.000     .5667855    .7887844
------------------------------------------------------------------------------

. regress vitezy_minusz mkkp mihazank tisza fidesz kispartok if part_total>0, n
> oconstant

      Source |       SS           df       MS      Number of obs   =     1,011
-------------+----------------------------------   F(5, 1006)      =  15296.33
       Model |  44793667.2         5  8958733.43   Prob > F        =    0.0000
    Residual |  589192.833     1,006   585.67876   R-squared       =    0.9870
-------------+----------------------------------   Adj R-squared   =    0.9870
       Total |    45382860     1,011  44889.0801   Root MSE        =    24.201

------------------------------------------------------------------------------
vitezy_min~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .2607336   .0426056     6.12   0.000     .1771276    .3443395
    mihazank |   .1120079   .1032067     1.09   0.278    -.0905172     .314533
       tisza |   .2779187   .0200152    13.89   0.000     .2386423     .317195
      fidesz |   .9109237   .0204173    44.62   0.000     .8708582    .9509891
   kispartok |    .243093   .0723918     3.36   0.001     .1010368    .3851491
------------------------------------------------------------------------------

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
