
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum kispartok ervenytelen

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS =  1203905
Iteration 1:  Residual SS = 999745.5
Iteration 2:  Residual SS =   961048
Iteration 3:  Residual SS =   947556
Iteration 4:  Residual SS = 942108.3
Iteration 5:  Residual SS = 927188.6
Iteration 6:  Residual SS = 927186.6
Iteration 7:  Residual SS = 927186.6


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,087
       Model |   80413357          5  16082671.5    R-squared     =     0.9886
    Residual |  927186.57       1082  856.919194    Adj R-squared =     0.9885
-------------+----------------------------------    Root MSE      =   29.27318
       Total |   81340544       1087  74830.3073    Res. dev.     =   10420.65

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .8885934   .1911482     4.65   0.000     .5135303    1.263656
   /mihazank |  -96.63922          .        .       .            .           .
      /tisza |   .3881833   .0472476     8.22   0.000      .295476    .4808907
        /lmp |  -6223.506          .        .       .            .           .
     /fidesz |  -32.36319          .        .       .            .           .
         /dk |   11.67059          .        .       .            .           .
   /momentum |   1.177227   .3811507     3.09   0.002     .4293486    1.925105
  /kispartok |   .4150383   .2347732     1.77   0.077    -.0456239    .8757005
/ervenytelen |   .1478714   .3211533     0.46   0.645    -.4822823    .7780252
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(129 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .013425       .0003418
 5%     .1182515       .0058228
10%     .2448507       .0076318       Obs               1,078
25%     .5941476       .0080592       Sum of wgt.       1,078

50%      1.28267                      Mean           1.543772
                        Largest       Std. dev.      1.238556
75%     2.163491        6.55197
90%      3.27092       6.975966       Variance        1.53402
95%     4.010809        6.98518       Skewness       1.288361
99%     5.458756       7.603109       Kurtosis       4.924606

Iteration 0:  Residual SS = 850536.9
Iteration 1:  Residual SS = 830814.5
Iteration 2:  Residual SS = 829003.3
Iteration 3:  Residual SS = 829003.3
Iteration 4:  Residual SS = 829003.3
Iteration 5:  Residual SS = 826689.9
Iteration 6:  Residual SS = 824775.8
Iteration 7:  Residual SS = 824752.3
Iteration 8:  Residual SS = 824717.4
Iteration 9:  Residual SS = 824717.4
Iteration 10: Residual SS = 824717.4


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,087
       Model |   79999711          6  13333285.1    R-squared     =     0.9898
    Residual |  824717.35       1081  762.920771    Adj R-squared =     0.9897
-------------+----------------------------------    Root MSE      =   27.62102
       Total |   80824428       1087  74355.4995    Res. dev.     =   10293.34

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7238804    .152219    -4.76   0.000    -1.022559   -.4252022
   /mihazank |  -1.244724   .6193095    -2.01   0.045    -2.459909   -.0295393
      /tisza |  -.5898112   .0660242    -8.93   0.000    -.7193614   -.4602611
        /lmp |   10.04344          .        .       .            .           .
     /fidesz |   1.291932   .1338819     9.65   0.000     1.029234    1.554629
         /dk |  -7.08e+07          .        .       .            .           .
   /momentum |  -130630.4          .        .       .            .           .
  /kispartok |  -.7366743   .2706362    -2.72   0.007    -1.267706   -.2056426
/ervenytelen |  -.4605979   .3452236    -1.33   0.182    -1.137982    .2167863
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(129 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0338825       .0008982
 5%     .1927569       .0025588
10%     .3219682       .0045134       Obs               1,078
25%     .7155368       .0062976       Sum of wgt.       1,078

50%     1.438571                      Mean            1.74481
                        Largest       Std. dev.      1.528402
75%     2.459112       8.410249
90%     3.448901       10.03384       Variance       2.336013
95%     4.335295       15.35491       Skewness       4.009584
99%     5.900276       22.99323       Kurtosis       43.90646

Iteration 0:  Residual SS =  3319984
Iteration 1:  Residual SS = 388822.7
Iteration 2:  Residual SS = 120416.9
Iteration 3:  Residual SS = 71175.24
Iteration 4:  Residual SS = 61757.05
Iteration 5:  Residual SS =  61528.7
Iteration 6:  Residual SS = 53586.55
Iteration 7:  Residual SS = 51871.69
Iteration 8:  Residual SS = 51861.14
Iteration 9:  Residual SS = 51861.13
Iteration 10: Residual SS = 51861.13


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,087
       Model |  945701.87          5  189140.374    R-squared     =     0.9480
    Residual |  51861.132       1082  47.9308059    Adj R-squared =     0.9478
-------------+----------------------------------    Root MSE      =   6.923208
       Total |     997563       1087  917.721251    Res. dev.     =   7286.188

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -7.575115          .        .       .            .           .
   /mihazank |   1.779106    .343799     5.17   0.000     1.104517    2.453694
      /tisza |  -1.88e+07          .        .       .            .           .
        /lmp |  -1.892594   .2087435    -9.07   0.000    -2.302182   -1.483006
     /fidesz |  -2.034289   .1072507   -18.97   0.000    -2.244731   -1.823846
         /dk |  -227.2093          .        .       .            .           .
   /momentum |  -270.2946          .        .       .            .           .
  /kispartok |  -1.737075   .2317792    -7.49   0.000    -2.191863   -1.282288
/ervenytelen |  -.9342171   .1200529    -7.78   0.000     -1.16978   -.6986542
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(129 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0158064       .0023009
 5%     .0660222       .0044984
10%     .1479119       .0062699       Obs               1,078
25%     .3898154       .0071174       Sum of wgt.       1,078

50%      .783321                      Mean           .9567759
                        Largest       Std. dev.      .7735925
75%     1.294886       4.184361
90%     1.980328       4.660048       Variance       .5984453
95%     2.497162       4.777501       Skewness       1.530161
99%     3.704093       6.125119       Kurtosis       6.770688

Iteration 0:  Residual SS =  3327782
Iteration 1:  Residual SS = 353391.8
Iteration 2:  Residual SS =   109805
Iteration 3:  Residual SS = 82055.18
Iteration 4:  Residual SS = 67449.83
Iteration 5:  Residual SS = 59547.65
Iteration 6:  Residual SS = 56631.09
Iteration 7:  Residual SS = 56398.14
Iteration 8:  Residual SS = 56397.91
Iteration 9:  Residual SS = 56397.91


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,087
       Model |  351177.09          5   70235.418    R-squared     =     0.8616
    Residual |   56397.91       1082  52.1237617    Adj R-squared =     0.8610
-------------+----------------------------------    Root MSE      =   7.219679
       Total |     407575       1087  374.954002    Res. dev.     =   7377.347

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   -1.81934    .147627   -12.32   0.000    -2.109008   -1.529673
   /mihazank |  -1.495939   .2160818    -6.92   0.000    -1.919926   -1.071952
      /tisza |  -9.456807          .        .       .            .           .
        /lmp |  -2250.918          .        .       .            .           .
     /fidesz |  -1.520359    .043404   -35.03   0.000    -1.605524   -1.435193
         /dk |  -26.82506          .        .       .            .           .
   /momentum |  -13.61009          .        .       .            .           .
  /kispartok |   -1.87102   .3074389    -6.09   0.000    -2.474264   -1.267776
/ervenytelen |   -.281899   .0837779    -3.36   0.001    -.4462845   -.1175134
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(129 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .015809       .0000111
 5%     .0687595       .0011159
10%     .1272323       .0045585       Obs               1,078
25%     .3416551       .0047872       Sum of wgt.       1,078

50%     .7280371                      Mean           .9931057
                        Largest       Std. dev.      1.102463
75%       1.3242       7.017497
90%     2.006378       8.020775       Variance       1.215425
95%     2.660121       8.196225       Skewness       5.277102
99%     4.943525       18.04368       Kurtosis       61.90971

. 
. * manually adjust models so that each party has a share between 0 and 1
. local karacsony0 fidesz lmp mihazank

. local karacsony1 dk momentum

. local vitezy0 dk

. local vitezy1 lmp

. 
. foreach jelolt in karacsony vitezy {
  2.     generate `jelolt'_minusz = `jelolt'
  3.     foreach one in ``jelolt'1' {
  4.         replace `jelolt'_minusz = `jelolt'_minusz - `one' if `jelolt' > 0
  5.     } 
  6. }
(1,077 real changes made)
(1,078 real changes made)
(1,078 real changes made)

. regress karacsony_minusz mkkp tisza kispartok if part_total>0, noconstant

      Source |       SS           df       MS      Number of obs   =     1,087
-------------+----------------------------------   F(3, 1084)      =  23173.23
       Model |  23671683.5         3  7890561.17   Prob > F        =    0.0000
    Residual |  369105.503     1,084  340.503232   R-squared       =    0.9846
-------------+----------------------------------   Adj R-squared   =    0.9846
       Total |    24040789     1,087  22116.6412   Root MSE        =    18.453

------------------------------------------------------------------------------
karacsony_~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .7897705   .0293871    26.87   0.000     .7321085    .8474325
       tisza |   .6774395    .008766    77.28   0.000     .6602393    .6946397
   kispartok |   .6668231   .0540513    12.34   0.000     .5607662    .7728801
------------------------------------------------------------------------------

. regress vitezy_minusz mkkp mihazank tisza fidesz kispartok if part_total>0, n
> oconstant

      Source |       SS           df       MS      Number of obs   =     1,087
-------------+----------------------------------   F(5, 1082)      =  18810.02
       Model |  49328386.2         5  9865677.24   Prob > F        =    0.0000
    Residual |  567498.823     1,082  524.490594   R-squared       =    0.9886
-------------+----------------------------------   Adj R-squared   =    0.9886
       Total |    49895885     1,087  45902.3781   Root MSE        =    22.902

------------------------------------------------------------------------------
vitezy_min~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |    .230362   .0386772     5.96   0.000     .1544712    .3062529
    mihazank |   .0854799   .0943321     0.91   0.365    -.0996146    .2705744
       tisza |   .2915903   .0182081    16.01   0.000     .2558631    .3273175
      fidesz |   .9143387   .0185776    49.22   0.000     .8778865    .9507909
   kispartok |   .2325491   .0682467     3.41   0.001     .0986383      .36646
------------------------------------------------------------------------------

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
