
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum neppartjan munkaspart
>  szolidaritas ervenytelen

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0 & `jelolt'>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS = 410120.1
Iteration 1:  Residual SS = 210822.3
Iteration 2:  Residual SS = 167543.2
Iteration 3:  Residual SS =   131247
Iteration 4:  Residual SS =   131247
Iteration 5:  Residual SS =   131247
Iteration 6:  Residual SS =   131247
Iteration 7:  Residual SS =   131247
Iteration 8:  Residual SS =   131247
Iteration 9:  Residual SS = 127338.5
Iteration 10: Residual SS = 127335.8
Iteration 11: Residual SS = 127335.8
Iteration 12: Residual SS = 127335.8
Iteration 13: Residual SS = 127335.8


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,149
       Model |   87771948          6    14628658    R-squared     =     0.9986
    Residual |  127335.75       1143  111.404859    Adj R-squared =     0.9985
-------------+----------------------------------    Root MSE      =   10.55485
       Total |   87899284       1149  76500.6823    Res. dev.     =   8670.138

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .7958492   .0621218    12.81   0.000     .6739636    .9177348
   /mihazank |  -45.24636          .        .       .            .           .
      /tisza |   .4282833   .0170016    25.19   0.000     .3949254    .4616411
        /lmp |  -13.66383          .        .       .            .           .
     /fidesz |  -9.99e+07          .        .       .            .           .
         /dk |   49178.37          .        .       .            .           .
   /momentum |   1.901774   .4161254     4.57   0.000     1.085318    2.718229
 /neppartjan |  -5.80e+07          .        .       .            .           .
 /munkaspart |   .4002786   .0926342     4.32   0.000     .2185264    .5820308
/szolidari~s |   .8337871   .3340086     2.50   0.013     .1784483    1.489126
/ervenytelen |   -.007625   .1108558    -0.07   0.945    -.2251287    .2098786
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(91 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0174429       .0003579
 5%      .115897       .0023012
10%     .2203083        .002661       Obs               1,149
25%     .5924693       .0029095       Sum of wgt.       1,149

50%     1.231874                      Mean           1.490754
                        Largest       Std. dev.      1.202665
75%     2.075916       6.433614
90%     3.078142       6.783529       Variance       1.446403
95%     3.836326       7.518787       Skewness       1.357629
99%     5.368075       7.787024       Kurtosis       5.379145

Iteration 0:  Residual SS = 180829.7
Iteration 1:  Residual SS = 166820.4
Iteration 2:  Residual SS = 165866.7
Iteration 3:  Residual SS = 164500.3
Iteration 4:  Residual SS = 155396.3
Iteration 5:  Residual SS = 154898.8
Iteration 6:  Residual SS = 154877.8
Iteration 7:  Residual SS = 154877.4
Iteration 8:  Residual SS = 154877.4
Iteration 9:  Residual SS = 154877.4


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,149
       Model |   87294634          8  10911829.2    R-squared     =     0.9982
    Residual |  154877.43       1141  135.738323    Adj R-squared =     0.9982
-------------+----------------------------------    Root MSE      =   11.65068
       Total |   87449511       1149   76109.235    Res. dev.     =    8895.12

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7365754   .0682989   -10.78   0.000    -.8705809     -.60257
   /mihazank |   -1.45555   .3377378    -4.31   0.000    -2.118207   -.7928934
      /tisza |  -.5004979    .027261   -18.36   0.000    -.5539851   -.4470106
        /lmp |   33567.02          .        .       .            .           .
     /fidesz |   1.247371    .052011    23.98   0.000     1.145323    1.349419
         /dk |  -17017.29          .        .       .            .           .
   /momentum |  -1.811474   .3923165    -4.62   0.000    -2.581217   -1.041731
 /neppartjan |  -143617.1          .        .       .            .           .
 /munkaspart |  -.5744845   .1123865    -5.11   0.000    -.7949919   -.3539771
/szolidari~s |  -1.458547   .7552901    -1.93   0.054    -2.940461    .0233661
/ervenytelen |  -.7185434   .1651609    -4.35   0.000    -1.042597   -.3944902
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(91 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0283724       .0001638
 5%     .1401013        .001816
10%     .2638402       .0064184       Obs               1,149
25%     .6650013       .0078859       Sum of wgt.       1,149

50%      1.38048                      Mean           1.695516
                        Largest       Std. dev.      1.489875
75%     2.329703       8.276814
90%     3.494957       9.020473       Variance       2.219727
95%     4.294434       14.95157       Skewness       3.576513
99%     6.108817       21.62197       Kurtosis       36.64409

Iteration 0:  Residual SS =  3538960
Iteration 1:  Residual SS = 385634.3
Iteration 2:  Residual SS = 100812.4
Iteration 3:  Residual SS = 62889.88
Iteration 4:  Residual SS = 49408.16
Iteration 5:  Residual SS = 48724.67
Iteration 6:  Residual SS = 44451.41
Iteration 7:  Residual SS = 44220.85
Iteration 8:  Residual SS = 44220.46
Iteration 9:  Residual SS = 44220.46
Iteration 10: Residual SS = 44220.46


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,149
       Model |  1015624.5          6  169270.757    R-squared     =     0.9583
    Residual |   44220.46       1143  38.6880666    Adj R-squared =     0.9581
-------------+----------------------------------    Root MSE      =   6.219973
       Total |    1059845       1149   922.40644    Res. dev.     =    7454.91

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -4.59e+08          .        .       .            .           .
   /mihazank |   1.464182    .178746     8.19   0.000     1.113475    1.814889
      /tisza |  -23.37974          .        .       .            .           .
        /lmp |  -1.848189   .1683215   -10.98   0.000    -2.178443   -1.517935
     /fidesz |  -2.045944   .0958172   -21.35   0.000    -2.233941   -1.857946
         /dk |  -5.20e+07          .        .       .            .           .
   /momentum |   -12.0427          .        .       .            .           .
 /neppartjan |   49669.64          .        .       .            .           .
 /munkaspart |  -2.218855   .5892662    -3.77   0.000     -3.37502   -1.062691
/szolidari~s |  -1.439272   .3920259    -3.67   0.000    -2.208443   -.6701008
/ervenytelen |  -.9645798   .1075122    -8.97   0.000    -1.175523   -.7536363
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(91 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0244971       .0055621
 5%     .0835118       .0076288
10%     .1639735       .0086544       Obs               1,149
25%     .3871927       .0091584       Sum of wgt.       1,149

50%     .7452126                      Mean            .921245
                        Largest       Std. dev.      .7376953
75%     1.252172       4.070594
90%     1.908017       4.549666       Variance       .5441943
95%     2.306986       5.004282       Skewness       1.667886
99%      3.46273       6.307712       Kurtosis        7.85014

Iteration 0:  Residual SS =  3573792
Iteration 1:  Residual SS = 373764.2
Iteration 2:  Residual SS = 112322.7
Iteration 3:  Residual SS = 83463.66
Iteration 4:  Residual SS = 67383.85
Iteration 5:  Residual SS = 66962.65
Iteration 6:  Residual SS = 55840.13
Iteration 7:  Residual SS = 55483.18
Iteration 8:  Residual SS =  55465.9
Iteration 9:  Residual SS = 55420.76
Iteration 10: Residual SS = 55420.75
Iteration 11: Residual SS = 55420.75


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,149
       Model |  380512.25          6  63418.7082    R-squared     =     0.8729
    Residual |  55420.751       1143   48.487096    Adj R-squared =     0.8722
-------------+----------------------------------    Root MSE      =   6.963268
       Total |     435933       1149  379.402089    Res. dev.     =   7714.316

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.666627    .106851   -15.60   0.000    -1.876273   -1.456981
   /mihazank |  -2.063947   .5523046    -3.74   0.000    -3.147592   -.9803026
      /tisza |   -1458656          .        .       .            .           .
        /lmp |  -11386.95          .        .       .            .           .
     /fidesz |  -1.536293   .0417392   -36.81   0.000    -1.618187   -1.454399
         /dk |  -8049.781          .        .       .            .           .
   /momentum |  -46.56392          .        .       .            .           .
 /neppartjan |   23.57554          .        .       .            .           .
 /munkaspart |  -2.317619   .8241803    -2.81   0.005    -3.934695   -.7005431
/szolidari~s |   -1.55921   .5249003    -2.97   0.003    -2.589086   -.5293336
/ervenytelen |   -.290052   .0784821    -3.70   0.000    -.4440372   -.1360669
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(91 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0197437       .0008576
 5%     .0681128       .0028113
10%     .1238049       .0050418       Obs               1,149
25%     .3385827        .005774       Sum of wgt.       1,149

50%     .7310206                      Mean           .9792543
                        Largest       Std. dev.      1.079946
75%     1.289774       7.256491
90%     1.956526       7.950626       Variance       1.166283
95%     2.614454       8.452029       Skewness       5.536665
99%     5.030184       18.43522       Kurtosis       68.68638

. 
. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(3 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
