
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum 

. local kispartok neppartjan munkaspart szolidaritas 

. local jeloltek karacsony vitezy grundtner ervenytelen 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. generate fidesz_share = fidesz / part_total
(687 missing values generated)

. foreach p in `partok' {
  2.     generate `p'_X_fidesz = `p' * fidesz_share
  3. }
(687 missing values generated)
(687 missing values generated)
(687 missing values generated)
(687 missing values generated)
(687 missing values generated)
(687 missing values generated)
(687 missing values generated)

. 
. foreach jelolt in `jeloltek' {
  2.     regress `jelolt' `partok' kispartok if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = _b[`part']
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict, xb
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(p95)
 11. }

      Source |       SS           df       MS      Number of obs   =       667
-------------+----------------------------------   F(8, 659)       =   6501.05
       Model |  44388962.2         8  5548620.27   Prob > F        =    0.0000
    Residual |  562453.813       659  853.495923   R-squared       =    0.9875
-------------+----------------------------------   Adj R-squared   =    0.9873
       Total |    44951416       667  67393.4273   Root MSE        =    29.215

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .7246762    .066187    10.95   0.000     .5947134    .8546391
    mihazank |  -.1288958   .1647408    -0.78   0.434    -.4523759    .1945844
       tisza |   .7600199   .0430029    17.67   0.000     .6755807     .844459
         lmp |  -.1986238   .1034641    -1.92   0.055    -.4017829    .0045354
      fidesz |   .0013546   .0329028     0.04   0.967    -.0632523    .0659615
          dk |   1.015107   .0471803    21.52   0.000     .9224654    1.107749
    momentum |   1.025516   .1091269     9.40   0.000      .811238    1.239795
   kispartok |   .7529853    .090864     8.29   0.000     .5745674    .9314032
------------------------------------------------------------------------------
(377 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0200981       .0000156
 5%     .1456257       .0043119
10%      .254525       .0079675       Obs                 661
25%     .6219134       .0092614       Sum of wgt.         661

50%     1.299879                      Mean           1.651217
                        Largest       Std. dev.      1.487313
75%     2.307807       7.272418
90%      3.48057       8.638833       Variance         2.2121
95%     4.200903       11.19263       Skewness       3.263427
99%     6.168928        18.1472       Kurtosis       28.47453

      Source |       SS           df       MS      Number of obs   =       667
-------------+----------------------------------   F(8, 659)       =   6429.42
       Model |  44382079.6         8  5547759.95   Prob > F        =    0.0000
    Residual |  568632.372       659  862.871581   R-squared       =    0.9873
-------------+----------------------------------   Adj R-squared   =    0.9872
       Total |    44950712       667  67392.3718   Root MSE        =    29.375

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .1673143   .0665495     2.51   0.012     .0366396     .297989
    mihazank |   .1106126   .1656432     0.67   0.505    -.2146395    .4358646
       tisza |   .3734906   .0432384     8.64   0.000     .2885889    .4583923
         lmp |   .9296389   .1040309     8.94   0.000     .7253669    1.133911
      fidesz |   .8967561    .033083    27.11   0.000     .8317953     .961717
          dk |  -.0843318   .0474387    -1.78   0.076    -.1774811    .0088174
    momentum |   .0940925   .1097246     0.86   0.391    -.1213595    .3095445
   kispartok |   .3011485   .0913617     3.30   0.001     .1217533    .4805436
------------------------------------------------------------------------------
(377 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0338526       .0002105
 5%     .1469996       .0003395
10%     .3003947       .0012981       Obs                 661
25%      .726043       .0034121       Sum of wgt.         661

50%     1.490842                      Mean           1.812423
                        Largest       Std. dev.      1.616921
75%      2.55464       12.23559
90%     3.577449        12.9646       Variance       2.614435
95%     4.289949       13.44407       Skewness       3.413226
99%     6.747734       18.00383       Kurtosis       26.94138

      Source |       SS           df       MS      Number of obs   =       667
-------------+----------------------------------   F(8, 659)       =   1600.54
       Model |  540635.186         8  67579.3982   Prob > F        =    0.0000
    Residual |  27824.8141       659  42.2227832   R-squared       =    0.9511
-------------+----------------------------------   Adj R-squared   =    0.9505
       Total |      568460       667  852.263868   Root MSE        =    6.4979

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |  -.0800843   .0147213    -5.44   0.000    -.1089906   -.0511781
    mihazank |   .8936675   .0366416    24.39   0.000     .8217193    .9656158
       tisza |   .0121994   .0095647     1.28   0.203    -.0065815    .0309803
         lmp |   .0705267   .0230124     3.06   0.002     .0253402    .1157132
      fidesz |    .047608   .0073182     6.51   0.000     .0332382    .0619778
          dk |  -.0003874   .0104938    -0.04   0.971    -.0209927    .0202179
    momentum |  -.0622426   .0242719    -2.56   0.011    -.1099022   -.0145829
   kispartok |   .0336658   .0202099     1.67   0.096    -.0060178    .0733494
------------------------------------------------------------------------------
(377 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0172299       .0052966
 5%     .0764488       .0123088
10%     .1486067       .0125673       Obs                 661
25%     .3237668       .0144509       Sum of wgt.         661

50%     .6918753                      Mean           .9011048
                        Largest       Std. dev.      .7845218
75%     1.222829       4.190778
90%     1.975297       4.204509       Variance       .6154745
95%     2.384812       5.021255       Skewness       1.698853
99%     3.691662       5.549535       Kurtosis       7.199675

      Source |       SS           df       MS      Number of obs   =       667
-------------+----------------------------------   F(8, 659)       =    430.36
       Model |  189964.196         8  23745.5245   Prob > F        =    0.0000
    Residual |  36360.8039       659  55.1757267   R-squared       =    0.8393
-------------+----------------------------------   Adj R-squared   =    0.8374
       Total |      226325       667  339.317841   Root MSE        =     7.428

------------------------------------------------------------------------------
 ervenytelen | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .0551692   .0168285     3.28   0.001     .0221252    .0882132
    mihazank |   .0817947   .0418865     1.95   0.051    -.0004525    .1640419
       tisza |  -.0153421   .0109338    -1.40   0.161    -.0368114    .0061271
         lmp |   -.035534   .0263065    -1.35   0.177    -.0871887    .0161207
      fidesz |   .0949886   .0083658    11.35   0.000     .0785618    .1114154
          dk |   .0270865   .0119959     2.26   0.024     .0035317    .0506414
    momentum |  -.0300434   .0277463    -1.08   0.279    -.0845252    .0244384
   kispartok |   .0115245   .0231028     0.50   0.618    -.0338395    .0568885
------------------------------------------------------------------------------
(377 missing values generated)

                       ae_ervenytelen
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0251687       .0106865
 5%     .0936713       .0128258
10%     .1560938       .0140785       Obs                 661
25%     .3525048       .0175213       Sum of wgt.         661

50%     .7816247                      Mean           1.087991
                        Largest       Std. dev.      1.352061
75%     1.350258       8.225103
90%     2.111564       9.310809       Variance       1.828068
95%     2.990997       9.931267       Skewness       5.946728
99%     6.298918       19.79931       Kurtosis       65.19864

. 
. * manually adjust models so that each party has a share between 0 and 1
. local karacsony0 fidesz lmp mihazank

. local karacsony1 dk momentum

. local vitezy0 dk

. local vitezy1 lmp

. 
. foreach jelolt in karacsony vitezy {
  2.     generate `jelolt'_minusz = `jelolt'
  3.     foreach one in ``jelolt'1' {
  4.         replace `jelolt'_minusz = `jelolt'_minusz - `one' if `jelolt' > 0
  5.     } 
  6. }
(660 real changes made)
(661 real changes made)
(661 real changes made)

. regress karacsony_minusz mkkp tisza kispartok if part_total>0, noconstant

      Source |       SS           df       MS      Number of obs   =       667
-------------+----------------------------------   F(3, 664)       =  13165.77
       Model |  13278992.3         3  4426330.77   Prob > F        =    0.0000
    Residual |  223236.692       664  336.199837   R-squared       =    0.9835
-------------+----------------------------------   Adj R-squared   =    0.9834
       Total |    13502229       667  20243.2219   Root MSE        =    18.336

------------------------------------------------------------------------------
karacsony_~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .7559429   .0367543    20.57   0.000     .6837743    .8281115
       tisza |   .6857602    .011168    61.40   0.000     .6638313    .7076891
   kispartok |   .6902322   .0546339    12.63   0.000     .5829561    .7975082
------------------------------------------------------------------------------

. regress vitezy_minusz mkkp mihazank tisza fidesz kispartok if part_total>0, n
> oconstant

      Source |       SS           df       MS      Number of obs   =       667
-------------+----------------------------------   F(5, 662)       =   9578.66
       Model |  27440830.2         5  5488166.04   Prob > F        =    0.0000
    Residual |  379297.822       662  572.957434   R-squared       =    0.9864
-------------+----------------------------------   Adj R-squared   =    0.9863
       Total |    27820128       667  41709.3373   Root MSE        =    23.937

------------------------------------------------------------------------------
vitezy_min~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .1966353   .0504124     3.90   0.000     .0976478    .2956228
    mihazank |   .0513276   .1313324     0.39   0.696    -.2065507    .3092059
       tisza |   .3244081   .0254982    12.72   0.000      .274341    .3744752
      fidesz |   .8915105   .0256458    34.76   0.000     .8411535    .9418674
   kispartok |   .2764428   .0727479     3.80   0.000     .1335985    .4192872
------------------------------------------------------------------------------

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok'

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen" if index == 4
variable jelolt was str9 now str11
(1 real change made)

. 
. foreach part in `partok' {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. list jelolt `partok'

     +------------------------------------------------------------------------+
  1. |      jelolt |      mkkp |  mihazank |     tisza |       lmp |   fidesz |
     |   karacsony |  20593.13 | -1811.888 |  74526.03 | -7214.214 | 140.9925 |
     |------------------------------------------------------------------------|
     |                    dk             |              momentum              |
     |              59696.43             |              17688.11              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  2. |      jelolt |      mkkp |  mihazank |     tisza |       lmp |   fidesz |
     |      vitezy |   4754.57 |  1554.881 |  36623.74 |  33765.41 | 93337.97 |
     |------------------------------------------------------------------------|
     |                    dk             |              momentum              |
     |             -4959.387             |              1622.908              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  3. |      jelolt |      mkkp |  mihazank |     tisza |       lmp |   fidesz |
     |   grundtner | -2275.756 |  12562.28 |  1196.246 |    2561.6 |  4955.23 |
     |------------------------------------------------------------------------|
     |                    dk             |              momentum              |
     |              -22.7822             |              -1073.56              |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  4. |      jelolt |      mkkp |  mihazank |     tisza |       lmp |   fidesz |
     | ervenytelen |  1567.743 |  1149.788 | -1504.419 |  -1290.63 | 9886.792 |
     |------------------------------------------------------------------------|
     |                    dk             |              momentum              |
     |              1592.905             |             -518.1883              |
     +------------------------------------------------------------------------+

. 
end of do-file
