
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum kispartok ervenytelen

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS =  1237475
Iteration 1:  Residual SS =  1047936
Iteration 2:  Residual SS =  1021933
Iteration 3:  Residual SS = 979097.4
Iteration 4:  Residual SS = 979064.3
Iteration 5:  Residual SS =   979061
Iteration 6:  Residual SS = 979060.5
Iteration 7:  Residual SS = 979060.4
Iteration 8:  Residual SS = 979060.4
Iteration 9:  Residual SS = 979060.4
Iteration 10: Residual SS = 979060.4
Iteration 11: Residual SS = 979060.4
Iteration 12: Residual SS = 979060.4
Iteration 13: Residual SS = 975808.2
Iteration 14: Residual SS = 974993.4
Iteration 15: Residual SS = 974981.9
Iteration 16: Residual SS = 974981.9


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,061
       Model |   78234645          4  19558661.3    R-squared     =     0.9877
    Residual |  974981.92       1057   922.40484    Adj R-squared =     0.9876
-------------+----------------------------------    Root MSE      =   30.37112
       Total |   79209627       1061  74655.6334    Res. dev.     =   10250.41

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .7589542    .163869     4.63   0.000     .4374086      1.0805
   /mihazank |  -68.11797          .        .       .            .           .
      /tisza |   .3528108   .0437287     8.07   0.000     .2670058    .4386158
        /lmp |  -8.132894          .        .       .            .           .
     /fidesz |  -1.17e+07          .        .       .            .           .
         /dk |    32648.4          .        .       .            .           .
   /momentum |   23.63586          .        .       .            .           .
  /kispartok |   .3761958   .2398362     1.57   0.117    -.0944134    .8468049
/ervenytelen |   .1919348   .3373383     0.57   0.569    -.4699941    .8538637
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(147 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0348726       .0056034
 5%     .1086628       .0067862
10%     .2432992       .0104377       Obs               1,051
25%     .5853508       .0119215       Sum of wgt.       1,051

50%     1.284675                      Mean            1.53964
                        Largest       Std. dev.      1.238731
75%     2.149031       6.373394
90%     3.296347        6.82965       Variance       1.534454
95%      3.98505       7.200801       Skewness       1.261568
99%     5.518557       7.645256       Kurtosis       4.818473

Iteration 0:  Residual SS =   910566
Iteration 1:  Residual SS =   895335
Iteration 2:  Residual SS = 895081.5
Iteration 3:  Residual SS = 895078.6
Iteration 4:  Residual SS = 895077.7
Iteration 5:  Residual SS = 895077.5
Iteration 6:  Residual SS = 895077.4
Iteration 7:  Residual SS = 895077.4
Iteration 8:  Residual SS = 895077.4
Iteration 9:  Residual SS = 895077.4
Iteration 10: Residual SS = 895077.4
Iteration 11: Residual SS = 895077.4
Iteration 12: Residual SS = 895077.4
Iteration 13: Residual SS = 895077.4
Iteration 14: Residual SS = 892519.7
Iteration 15: Residual SS = 886895.9
Iteration 16: Residual SS =   886895
Iteration 17: Residual SS =   886895


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,061
       Model |   77676014          7  11096573.4    R-squared     =     0.9887
    Residual |  886894.99       1054   841.45635    Adj R-squared =     0.9886
-------------+----------------------------------    Root MSE      =   29.00787
       Total |   78562909       1061  74046.0971    Res. dev.     =   10149.94

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.8216849   .1874554    -4.38   0.000    -1.189513   -.4538568
   /mihazank |  -1.239882   .6594184    -1.88   0.060    -2.533804    .0540403
      /tisza |  -.6374335   .0767011    -8.31   0.000    -.7879377   -.4869293
        /lmp |   92.01841          .        .       .            .           .
     /fidesz |   1.301601   .1454901     8.95   0.000     1.016118    1.587084
         /dk |  -6.06e+07          .        .       .            .           .
   /momentum |  -1.220129   .4129688    -2.95   0.003    -2.030463    -.409794
  /kispartok |  -.7768989   .2939358    -2.64   0.008    -1.353665   -.2001331
/ervenytelen |  -.4364701   .3634862    -1.20   0.230    -1.149709    .2767688
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(147 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .041991        .003545
 5%     .1693406       .0080401
10%     .3264043       .0090439       Obs               1,051
25%      .715891        .012199       Sum of wgt.       1,051

50%     1.421784                      Mean           1.749786
                        Largest       Std. dev.      1.539638
75%     2.421189        8.22818
90%     3.421414       10.03765       Variance       2.370486
95%     4.152273       15.55099       Skewness       4.175913
99%     6.056163       23.44081       Kurtosis       46.93161

Iteration 0:  Residual SS =  3232290
Iteration 1:  Residual SS = 377763.5
Iteration 2:  Residual SS = 115672.6
Iteration 3:  Residual SS = 68611.79
Iteration 4:  Residual SS = 60448.43
Iteration 5:  Residual SS = 60341.86
Iteration 6:  Residual SS = 53200.31
Iteration 7:  Residual SS = 51435.96
Iteration 8:  Residual SS = 51425.08
Iteration 9:  Residual SS = 51425.07
Iteration 10: Residual SS = 51425.07


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,061
       Model |  923300.93          5  184660.185    R-squared     =     0.9472
    Residual |  51425.073       1056  48.6979854    Adj R-squared =     0.9470
-------------+----------------------------------    Root MSE      =   6.978394
       Total |     974726       1061  918.686145    Res. dev.     =   7128.637

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -7.904534          .        .       .            .           .
   /mihazank |   1.823826   .3791482     4.81   0.000     1.079857    2.567796
      /tisza |   -5535791          .        .       .            .           .
        /lmp |  -1.890423    .212813    -8.88   0.000    -2.308007   -1.472838
     /fidesz |  -2.031406    .109384   -18.57   0.000     -2.24604   -1.816771
         /dk |   -2857559          .        .       .            .           .
   /momentum |  -40.09622          .        .       .            .           .
  /kispartok |  -1.761747   .2442008    -7.21   0.000    -2.240921   -1.282573
/ervenytelen |  -.9749915   .1268188    -7.69   0.000    -1.223837    -.726146
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(147 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0163573       .0007626
 5%     .0713425       .0015089
10%     .1469569       .0052609       Obs               1,051
25%     .3926423       .0099617       Sum of wgt.       1,051

50%     .7828826                      Mean           .9561833
                        Largest       Std. dev.      .7711551
75%     1.285969         4.2402
90%     1.969305       4.653724       Variance       .5946803
95%     2.430885       4.847288       Skewness       1.563569
99%     3.701863       6.135128       Kurtosis       7.012036

Iteration 0:  Residual SS =  3241579
Iteration 1:  Residual SS = 341741.4
Iteration 2:  Residual SS = 104663.5
Iteration 3:  Residual SS =    79757
Iteration 4:  Residual SS = 67478.41
Iteration 5:  Residual SS =  58354.2
Iteration 6:  Residual SS = 55293.59
Iteration 7:  Residual SS =  55256.9
Iteration 8:  Residual SS = 55201.29
Iteration 9:  Residual SS = 55201.27
Iteration 10: Residual SS = 55201.27


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,061
       Model |  341614.73          5  68322.9468    R-squared     =     0.8609
    Residual |  55201.266       1056  52.2739261    Adj R-squared =     0.8602
-------------+----------------------------------    Root MSE      =   7.230071
       Total |     396816       1061  374.001885    Res. dev.     =    7203.82

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.827691   .1516219   -12.05   0.000    -2.125206   -1.530177
   /mihazank |   -1.50452   .2219733    -6.78   0.000    -1.940079   -1.068961
      /tisza |  -18.43859          .        .       .            .           .
        /lmp |    -317.02          .        .       .            .           .
     /fidesz |  -1.519602   .0439638   -34.56   0.000    -1.605868   -1.433335
         /dk |  -39.34758          .        .       .            .           .
   /momentum |  -13.51487          .        .       .            .           .
  /kispartok |  -1.916144   .3356844    -5.71   0.000    -2.574828   -1.257459
/ervenytelen |  -.2742333   .0844262    -3.25   0.001    -.4398955   -.1085712
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(147 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0123405       .0006771
 5%     .0675896       .0023745
10%     .1295985       .0059278       Obs               1,051
25%     .3349745       .0062436       Sum of wgt.       1,051

50%     .7249092                      Mean           .9909995
                        Largest       Std. dev.      1.108228
75%     1.322884       7.009876
90%     2.001499       8.024795       Variance       1.228169
95%     2.665274       8.188277       Skewness        5.29663
99%      4.94961       18.02219       Kurtosis       61.87234

. 
. * manually adjust models so that each party has a share between 0 and 1
. local karacsony0 fidesz lmp mihazank

. local karacsony1 dk momentum

. local vitezy0 dk

. local vitezy1 lmp

. 
. foreach jelolt in karacsony vitezy {
  2.     generate `jelolt'_minusz = `jelolt'
  3.     foreach one in ``jelolt'1' {
  4.         replace `jelolt'_minusz = `jelolt'_minusz - `one' if `jelolt' > 0
  5.     } 
  6. }
(1,050 real changes made)
(1,051 real changes made)
(1,051 real changes made)

. regress karacsony_minusz mkkp tisza kispartok if part_total>0, noconstant

      Source |       SS           df       MS      Number of obs   =     1,061
-------------+----------------------------------   F(3, 1058)      =  20962.66
       Model |  23046610.9         3  7682203.62   Prob > F        =    0.0000
    Residual |  387726.126     1,058  366.470819   R-squared       =    0.9835
-------------+----------------------------------   Adj R-squared   =    0.9834
       Total |    23434337     1,061  22087.0283   Root MSE        =    19.143

------------------------------------------------------------------------------
karacsony_~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .7855978   .0308841    25.44   0.000     .7249967    .8461989
       tisza |   .6775495   .0092052    73.61   0.000      .659487     .695612
   kispartok |   .6641424   .0561474    11.83   0.000     .5539695    .7743154
------------------------------------------------------------------------------

. regress vitezy_minusz mkkp mihazank tisza fidesz kispartok if part_total>0, n
> oconstant

      Source |       SS           df       MS      Number of obs   =     1,061
-------------+----------------------------------   F(5, 1056)      =  16862.44
       Model |  47931608.5         5  9586321.69   Prob > F        =    0.0000
    Residual |  600337.532     1,056   568.50145   R-squared       =    0.9876
-------------+----------------------------------   Adj R-squared   =    0.9876
       Total |    48531946     1,061  45741.7022   Root MSE        =    23.843

------------------------------------------------------------------------------
vitezy_min~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .2304613   .0407598     5.65   0.000     .1504818    .3104407
    mihazank |   .0720261   .0993317     0.73   0.469    -.1228839    .2669362
       tisza |   .2873422   .0192454    14.93   0.000     .2495785    .3251058
      fidesz |   .9185116   .0196614    46.72   0.000     .8799318    .9570914
   kispartok |   .2289089   .0711427     3.22   0.001     .0893118    .3685061
------------------------------------------------------------------------------

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
