
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum neppartjan munkaspart
>  szolidaritas ervenytelen

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0 & `jelolt'>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS = 457493.2
Iteration 1:  Residual SS = 239047.6
Iteration 2:  Residual SS = 191092.4
Iteration 3:  Residual SS = 145925.5
Iteration 4:  Residual SS = 138110.9
Iteration 5:  Residual SS = 138106.5
Iteration 6:  Residual SS = 138106.5
Iteration 7:  Residual SS = 138106.5
Iteration 8:  Residual SS = 138106.5


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,237
       Model |   97604486          6  16267414.3    R-squared     =     0.9986
    Residual |  138106.48       1231  112.190483    Adj R-squared =     0.9986
-------------+----------------------------------    Root MSE      =     10.592
       Total |   97742592       1237  79015.8383    Res. dev.     =   9343.324

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .7837173    .060203    13.02   0.000     .6656055    .9018291
   /mihazank |  -129.0769          .        .       .            .           .
      /tisza |   .4317841    .016518    26.14   0.000     .3993775    .4641907
        /lmp |  -13.47708          .        .       .            .           .
     /fidesz |  -8.00e+08          .        .       .            .           .
         /dk |   152926.7          .        .       .            .           .
   /momentum |   2.003921   .4889719     4.10   0.000     1.044611    2.963232
 /neppartjan |  -65200.76          .        .       .            .           .
 /munkaspart |   .3946468   .0926099     4.26   0.000     .2129561    .5763374
/szolidari~s |   .7888716   .3216578     2.45   0.014     .1578134     1.41993
/ervenytelen |  -.0012448   .1080301    -0.01   0.991    -.2131882    .2106986
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(46 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0211639       .0003601
 5%     .1135047       .0027815
10%     .2285851       .0033523       Obs               1,237
25%     .5928077       .0040921       Sum of wgt.       1,237

50%     1.238026                      Mean           1.476036
                        Largest       Std. dev.       1.19837
75%      2.05676       6.391996
90%     3.048918       6.811507       Variance       1.436092
95%     3.829933       7.578804       Skewness        1.39069
99%     5.400745       7.837026       Kurtosis       5.497048

Iteration 0:  Residual SS = 200687.7
Iteration 1:  Residual SS = 186629.7
Iteration 2:  Residual SS = 185330.8
Iteration 3:  Residual SS = 185319.7
Iteration 4:  Residual SS = 185319.5
Iteration 5:  Residual SS = 185319.3
Iteration 6:  Residual SS = 185319.3
Iteration 7:  Residual SS = 185319.3
Iteration 8:  Residual SS = 185319.3
Iteration 9:  Residual SS = 185319.3
Iteration 10: Residual SS = 185319.3
Iteration 11: Residual SS = 180507.9
Iteration 12: Residual SS = 172423.7
Iteration 13: Residual SS = 170302.6
Iteration 14: Residual SS = 170229.3
Iteration 15: Residual SS = 170226.6
Iteration 16: Residual SS = 170226.6
Iteration 17: Residual SS = 170226.6
Iteration 18: Residual SS = 170226.6


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,237
       Model |   96033516          8  12004189.6    R-squared     =     0.9982
    Residual |  170226.56       1229  138.508182    Adj R-squared =     0.9982
-------------+----------------------------------    Root MSE      =   11.76895
       Total |   96203743       1237  77771.8213    Res. dev.     =   9601.988

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7363977   .0673536   -10.93   0.000    -.8685385   -.6042569
   /mihazank |  -1.366357   .2908017    -4.70   0.000    -1.936879   -.7958338
      /tisza |  -.5242114   .0267036   -19.63   0.000    -.5766011   -.4718218
        /lmp |   101.1229          .        .       .            .           .
     /fidesz |   1.282682   .0528365    24.28   0.000     1.179022    1.386341
         /dk |  -7.15e+07          .        .       .            .           .
   /momentum |  -1.971186   .5131495    -3.84   0.000    -2.977932   -.9644405
 /neppartjan |  -347285.3          .        .       .            .           .
 /munkaspart |  -.5859555   .1140426    -5.14   0.000    -.8096952   -.3622158
/szolidari~s |  -1.590915   .9292255    -1.71   0.087    -3.413959    .2321285
/ervenytelen |  -.6536546   .1551522    -4.21   0.000    -.9580471   -.3492622
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(46 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0196019       .0001599
 5%     .1466213        .000987
10%     .2565208        .003819       Obs               1,237
25%     .6810201       .0040295       Sum of wgt.       1,237

50%     1.364449                      Mean           1.688708
                        Largest       Std. dev.      1.487402
75%      2.31425       8.482483
90%     3.510185       9.457896       Variance       2.212364
95%     4.212847       15.33498       Skewness       3.653145
99%     6.116363       22.25698       Kurtosis       38.70714

Iteration 0:  Residual SS =  3910678
Iteration 1:  Residual SS =   420020
Iteration 2:  Residual SS = 109808.6
Iteration 3:  Residual SS = 75772.35
Iteration 4:  Residual SS = 53786.94
Iteration 5:  Residual SS = 52086.07
Iteration 6:  Residual SS = 48227.42
Iteration 7:  Residual SS = 47352.37
Iteration 8:  Residual SS = 47349.74
Iteration 9:  Residual SS = 47349.74
Iteration 10: Residual SS = 47349.74


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,237
       Model |  1101964.3          6  183660.711    R-squared     =     0.9588
    Residual |  47349.736       1231  38.4644484    Adj R-squared =     0.9586
-------------+----------------------------------    Root MSE      =   6.201971
       Total |    1149314       1237  929.113985    Res. dev.     =   8019.161

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   -9749081          .        .       .            .           .
   /mihazank |   1.470003   .1736605     8.46   0.000       1.1293    1.810706
      /tisza |  -17.17499          .        .       .            .           .
        /lmp |  -1.822302   .1529655   -11.91   0.000    -2.122403     -1.5222
     /fidesz |  -2.079506   .0986866   -21.07   0.000    -2.273118   -1.885893
         /dk |  -36.22522          .        .       .            .           .
   /momentum |   -13.1642          .        .       .            .           .
 /neppartjan |   1.62e+08          .        .       .            .           .
 /munkaspart |  -2.183283   .5428255    -4.02   0.000    -3.248249   -1.118317
/szolidari~s |  -1.429669   .3838235    -3.72   0.000    -2.182689   -.6766481
/ervenytelen |  -.9390178    .101778    -9.23   0.000    -1.138695   -.7393403
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(46 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .019918       .0005812
 5%      .084688       .0006415
10%      .166749       .0014375       Obs               1,237
25%     .3854529       .0019973       Sum of wgt.       1,237

50%     .7385952                      Mean           .9084015
                        Largest       Std. dev.       .730051
75%     1.229071       4.078329
90%     1.877327       4.563281       Variance       .5329745
95%     2.299827       5.018636       Skewness       1.700183
99%     3.394401       6.375754       Kurtosis        8.03574

Iteration 0:  Residual SS =  3933390
Iteration 1:  Residual SS = 406472.4
Iteration 2:  Residual SS = 120506.6
Iteration 3:  Residual SS = 89379.68
Iteration 4:  Residual SS = 72862.19
Iteration 5:  Residual SS = 72502.61
Iteration 6:  Residual SS = 61781.04
Iteration 7:  Residual SS =  61520.3
Iteration 8:  Residual SS = 61510.86
Iteration 9:  Residual SS = 61510.56
Iteration 10: Residual SS = 61510.55
Iteration 11: Residual SS = 61510.55
Iteration 12: Residual SS = 61510.55


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,237
       Model |  414454.45          7   59207.778    R-squared     =     0.8708
    Residual |  61510.554       1230  50.0085805    Adj R-squared =     0.8700
-------------+----------------------------------    Root MSE      =   7.071675
       Total |     475965       1237  384.773646    Res. dev.     =   8342.819

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.655994   .1185942   -13.96   0.000    -1.888664   -1.423325
   /mihazank |   -1.99097    .468531    -4.25   0.000    -2.910178   -1.071761
      /tisza |  -22342.03          .        .       .            .           .
        /lmp |  -4253.914          .        .       .            .           .
     /fidesz |  -1.535726    .042343   -36.27   0.000    -1.618798   -1.452653
         /dk |  -3910.839          .        .       .            .           .
   /momentum |  -3.026311   4.037614    -0.75   0.454    -10.94768    4.895061
 /neppartjan |   13.14998          .        .       .            .           .
 /munkaspart |  -2.353228   .9093938    -2.59   0.010    -4.137363   -.5690931
/szolidari~s |  -1.422455   .4331758    -3.28   0.001      -2.2723   -.5726096
/ervenytelen |  -.3488314   .0790419    -4.41   0.000    -.5039033   -.1937595
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(46 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0110809       .0000768
 5%     .0590918       .0022884
10%     .1175713       .0033528       Obs               1,237
25%     .3431668       .0047918       Sum of wgt.       1,237

50%     .7288002                      Mean           .9808143
                        Largest       Std. dev.      1.083281
75%     1.290795       7.319327
90%     1.948467       7.947598       Variance       1.173497
95%      2.63206       8.496359       Skewness       5.401585
99%     5.050296       18.60023       Kurtosis       66.17752

. 
. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
