
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum kispartok 

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + exp({`part'})/(1+exp({`part'}))*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     regress `jelolt' `partok' if part_total>0, noconstant robust
  3.     nl (`jelolt' = `formula') if part_total>0, noconstant
  4.     foreach part in `partok' {
  5.         scalar b_`jelolt'_`part' = _b[/`part']
  6.         scalar `jelolt'_`part' = exp(_b[/`part'])/(1+exp(_b[/`part']))
  7.         *generate `jelolt'_X_`part' = `jelolt'_`part' * `part'
.     }
  8.     predict `jelolt'_predict
  9.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
 10.     scatter `jelolt' `jelolt'_predict, msize(tiny)
 11. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 12.     scalar hiba_`jelolt' = r(mean)
 13. }

Linear regression                               Number of obs     =      1,354
                                                F(8, 1346)        >   99999.00
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9986
                                                Root MSE          =     10.813

------------------------------------------------------------------------------
             |               Robust
   karacsony | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .7854948   .0180701    43.47   0.000     .7500462    .8209435
    mihazank |  -.2021124   .0482557    -4.19   0.000     -.296777   -.1074479
       tisza |   .7104238   .0114172    62.22   0.000     .6880264    .7328212
         lmp |  -.1063512   .0247917    -4.29   0.000    -.1549857   -.0577166
      fidesz |   .0126173    .008592     1.47   0.142    -.0042379    .0294724
          dk |   1.071789   .0151675    70.66   0.000     1.042034    1.101543
    momentum |   .9386172   .0231409    40.56   0.000     .8932211    .9840134
   kispartok |   .5959931   .2511045     2.37   0.018     .1033943    1.088592
------------------------------------------------------------------------------

Iteration 0:  Residual SS = 497679.9
Iteration 1:  Residual SS = 268131.3
Iteration 2:  Residual SS = 209213.5
Iteration 3:  Residual SS = 193127.6
Iteration 4:  Residual SS = 172949.5
Iteration 5:  Residual SS =   170105
Iteration 6:  Residual SS =   170050
Iteration 7:  Residual SS =   166286
Iteration 8:  Residual SS = 166285.8
Iteration 9:  Residual SS = 166285.8
Iteration 10: Residual SS = 166285.8


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1.097e+08          4  27423896.1    R-squared     =     0.9985
    Residual |  166285.78       1350  123.174651    Adj R-squared =     0.9985
-------------+----------------------------------    Root MSE      =   11.09841
       Total |  1.099e+08       1354  81138.7518    Res. dev.     =    10356.1

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   1.361653   .1094982    12.44   0.000     1.146848    1.576458
   /mihazank |  -402.7689          .        .       .            .           .
      /tisza |   .8301591   .0266613    31.14   0.000     .7778569    .8824612
        /lmp |  -3.25e+07          .        .       .            .           .
     /fidesz |  -149.5188          .        .       .            .           .
         /dk |   522.8621          .        .       .            .           .
   /momentum |   3.024806   .5896263     5.13   0.000     1.868123    4.181489
  /kispartok |   .0160405   .3190568     0.05   0.960    -.6098605    .6419414
------------------------------------------------------------------------------
(option yhat assumed; fitted values)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0229412       .0013725
 5%     .1116363       .0072128
10%     .2302276       .0108461       Obs               1,354
25%      .582724       .0109397       Sum of wgt.       1,354

50%     1.212771                      Mean           1.508218
                        Largest       Std. dev.      1.254284
75%     2.088162       7.401563
90%     3.147195        8.06742       Variance       1.573229
95%     3.991769       8.070304       Skewness         1.5973
99%     5.809659       8.765491       Kurtosis        6.69606

Linear regression                               Number of obs     =      1,354
                                                F(8, 1346)        =   89341.11
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9982
                                                Root MSE          =     11.938

------------------------------------------------------------------------------
             |               Robust
      vitezy | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .2256131   .0189724    11.89   0.000     .1883945    .2628318
    mihazank |   .0961109   .0473053     2.03   0.042     .0033107     .188911
       tisza |   .3192318   .0119178    26.79   0.000     .2958524    .3426113
         lmp |   1.081372   .0286704    37.72   0.000     1.025129    1.137616
      fidesz |   .9173026   .0096205    95.35   0.000     .8984298    .9361755
          dk |  -.0669545   .0149954    -4.46   0.000    -.0963715   -.0375375
    momentum |   .0059879   .0247855     0.24   0.809    -.0426346    .0546104
   kispartok |  -.2764659   .2263547    -1.22   0.222    -.7205123    .1675804
------------------------------------------------------------------------------

Iteration 0:  Residual SS = 235391.2
Iteration 1:  Residual SS = 208500.1
Iteration 2:  Residual SS = 207882.7
Iteration 3:  Residual SS = 207628.1
Iteration 4:  Residual SS = 197668.7
Iteration 5:  Residual SS = 197638.2
Iteration 6:  Residual SS = 197638.1
Iteration 7:  Residual SS = 197638.1
Iteration 8:  Residual SS = 197638.1


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1.077e+08          5  21534625.6    R-squared     =     0.9982
    Residual |  197638.13       1349  146.507139    Adj R-squared =     0.9982
-------------+----------------------------------    Root MSE      =   12.10401
       Total |  1.079e+08       1354  79668.2171    Res. dev.     =   10589.97

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.256309   .1176982   -10.67   0.000    -1.487201   -1.025418
   /mihazank |  -2.607542   .6845982    -3.81   0.000    -3.950535    -1.26455
      /tisza |  -.8098474   .0422345   -19.18   0.000    -.8926999   -.7269948
        /lmp |   573.8877          .        .       .            .           .
     /fidesz |   2.413822   .1137419    21.22   0.000     2.190692    2.636952
         /dk |  -38.47261          .        .       .            .           .
   /momentum |  -4.667145   3.092207    -1.51   0.131     -10.7332    1.398912
  /kispartok |  -9261.083          .        .       .            .           .
------------------------------------------------------------------------------
(option yhat assumed; fitted values)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0127609       .0001216
 5%     .1223648       .0002249
10%     .2286044       .0010827       Obs               1,354
25%     .6407496       .0012037       Sum of wgt.       1,354

50%     1.414412                      Mean           1.706937
                        Largest       Std. dev.      1.503487
75%     2.294996       9.081636
90%     3.548748       10.39745       Variance       2.260472
95%     4.426693       15.56493       Skewness       3.082172
99%     6.239846       20.62481       Kurtosis       27.94446

Linear regression                               Number of obs     =      1,354
                                                F(8, 1346)        =    3557.45
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9587
                                                Root MSE          =     6.1979

------------------------------------------------------------------------------
             |               Robust
   grundtner | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |  -.0747338   .0102212    -7.31   0.000    -.0947851   -.0546825
    mihazank |   .8892932   .0269154    33.04   0.000     .8364925    .9420939
       tisza |    .004275   .0060619     0.71   0.481    -.0076167    .0161668
         lmp |   .0599275   .0152154     3.94   0.000      .030079     .089776
      fidesz |    .040696   .0047291     8.61   0.000     .0314187    .0499733
          dk |   .0124247   .0071869     1.73   0.084     -.001674    .0265235
    momentum |  -.0375323   .0137651    -2.73   0.006    -.0645356   -.0105289
   kispartok |   .2800571   .1294219     2.16   0.031     .0261666    .5339476
------------------------------------------------------------------------------

Iteration 0:  Residual SS =  5492130
Iteration 1:  Residual SS = 684125.9
Iteration 2:  Residual SS = 158818.6
Iteration 3:  Residual SS = 96227.56
Iteration 4:  Residual SS = 62010.07
Iteration 5:  Residual SS = 59529.28
Iteration 6:  Residual SS = 59529.28
Iteration 7:  Residual SS = 55201.48
Iteration 8:  Residual SS = 55100.25
Iteration 9:  Residual SS = 55098.62
Iteration 10: Residual SS = 55098.61
Iteration 11: Residual SS = 55098.61
Iteration 12: Residual SS = 55098.61


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1196323.4          5  239264.678    R-squared     =     0.9560
    Residual |  55098.609       1349  40.8440393    Adj R-squared =     0.9558
-------------+----------------------------------    Root MSE      =   6.390934
       Total |    1251422       1354  924.240768    Res. dev.     =   8860.493

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |    -4435.1          .        .       .            .           .
   /mihazank |   2.758521   .4132176     6.68   0.000     1.947902    3.569139
      /tisza |  -461.8377          .        .       .            .           .
        /lmp |   -3.24346   .3598455    -9.01   0.000    -3.949378   -2.537542
     /fidesz |  -3.661876   .1762322   -20.78   0.000    -4.007594   -3.316157
         /dk |  -6.263252   3.254864    -1.92   0.055     -12.6484    .1218924
   /momentum |  -2.31e+09          .        .       .            .           .
  /kispartok |  -.8338762   .2229681    -3.74   0.000    -1.271278   -.3964743
------------------------------------------------------------------------------
(option yhat assumed; fitted values)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0131776        .000867
 5%     .0662333       .0012181
10%     .1588469       .0012635       Obs               1,354
25%     .3878385       .0049841       Sum of wgt.       1,354

50%     .7442473                      Mean           .9278825
                        Largest       Std. dev.      .7643972
75%     1.305221       4.588116
90%     1.897377        5.40132       Variance       .5843031
95%      2.40751       5.493029       Skewness       1.736854
99%     3.437833       6.464808       Kurtosis       8.230862

Linear regression                               Number of obs     =      1,354
                                                F(8, 1346)        =     918.95
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8438
                                                Root MSE          =     7.9153

------------------------------------------------------------------------------
             |               Robust
ervenytele~o | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .0519166    .013118     3.96   0.000     .0261828    .0776505
    mihazank |   .0731678   .0331168     2.21   0.027     .0082016     .138134
       tisza |   -.005235   .0075769    -0.69   0.490    -.0200989    .0096288
         lmp |  -.0438121   .0177664    -2.47   0.014     -.078665   -.0089593
      fidesz |   .0876239   .0061696    14.20   0.000     .0755208    .0997269
          dk |     .01813   .0092646     1.96   0.051    -.0000448    .0363047
    momentum |  -.0042519    .016521    -0.26   0.797    -.0366617    .0281578
   kispartok |   .3029761   .1907485     1.59   0.112    -.0712207    .6771728
------------------------------------------------------------------------------

Iteration 0:  Residual SS =  5399986
Iteration 1:  Residual SS = 609118.8
Iteration 2:  Residual SS = 157195.3
Iteration 3:  Residual SS = 110614.1
Iteration 4:  Residual SS = 92452.59
Iteration 5:  Residual SS = 91802.79
Iteration 6:  Residual SS = 85503.81
Iteration 7:  Residual SS =    84958
Iteration 8:  Residual SS = 84952.98
Iteration 9:  Residual SS = 84952.98
Iteration 10: Residual SS = 84952.98


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  454991.02          5  90998.2046    R-squared     =     0.8427
    Residual |  84952.977       1349  62.9747793    Adj R-squared =     0.8421
-------------+----------------------------------    Root MSE      =   7.935665
       Total |     539944       1354  398.776957    Res. dev.     =   9446.739

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -3.140304   .2964027   -10.59   0.000    -3.721765   -2.558844
   /mihazank |  -2.940696   .5995755    -4.90   0.000    -4.116898   -1.764494
      /tisza |  -921.6261          .        .       .            .           .
        /lmp |  -45.34782          .        .       .            .           .
     /fidesz |  -2.442465   .0721471   -33.85   0.000    -2.583997   -2.300932
         /dk |  -5.240736   1.342962    -3.90   0.000    -7.875257   -2.606215
   /momentum |  -1.60e+09          .        .       .            .           .
  /kispartok |   -.855418   .2792762    -3.06   0.002    -1.403281   -.3075552
------------------------------------------------------------------------------
(option yhat assumed; fitted values)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%       .02057       .0008978
 5%     .0788288         .00183
10%     .1479884       .0025484       Obs               1,354
25%     .3907668       .0054133       Sum of wgt.       1,354

50%     .8053475                      Mean           1.082071
                        Largest       Std. dev.      1.199892
75%     1.384361       8.447628
90%     2.158843       9.782578       Variance       1.439742
95%     3.131855        9.94051       Skewness       5.028547
99%     5.537375       19.84664       Kurtosis       55.67539

. 
. foreach part in `partok' {
  2.     scalar logit_nest_`part' = 0
  3.     foreach jelolt in `jeloltek' {
  4.         scalar logit_nest_`part' = logit_nest_`part' + exp(b_`jelolt'_`par
> t')
  5.     }
  6. }

. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + exp({`part'})/(logit_nest_`part'+exp({`part'
> }))*`part'
  3. }

. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar l_`jelolt'_`part' = exp(_b[/`part'])/(logit_nest_`part'+exp
> (_b[/`part']))
  5.     }
  6. }

Iteration 0:  Residual SS =  1491157
Iteration 1:  Residual SS =  1491152
Iteration 2:  Residual SS =  1491097
Iteration 3:  Residual SS =  1457981
Iteration 4:  Residual SS =  1439079
Iteration 5:  Residual SS =  1434176
Iteration 6:  Residual SS =  1433600
Iteration 7:  Residual SS =  1433500
Iteration 8:  Residual SS =  1433480
Iteration 9:  Residual SS =  1433479
Iteration 10: Residual SS =  1433478
Iteration 11: Residual SS =  1433478
Iteration 12: Residual SS =  1433478
Iteration 13: Residual SS =  1433478
Iteration 14: Residual SS =  1433478
Iteration 15: Residual SS =  1433478
Iteration 16: Residual SS =  1433478
Iteration 17: Residual SS =  1228306
Iteration 18: Residual SS =  1227170
Iteration 19: Residual SS =  1226929
Iteration 20: Residual SS =  1226869
Iteration 21: Residual SS =  1226865
Iteration 22: Residual SS =  1226865
Iteration 23: Residual SS =  1226865
Iteration 24: Residual SS =  1226865
Iteration 25: Residual SS =  1226865
Iteration 26: Residual SS =  1225167
Iteration 27: Residual SS =  1225166
Iteration 28: Residual SS =  1225166


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1.086e+08          3  36212234.8    R-squared     =     0.9888
    Residual |  1225165.6       1351  906.858361    Adj R-squared =     0.9888
-------------+----------------------------------    Root MSE      =   30.11409
       Total |  1.099e+08       1354  81138.7518    Res. dev.     =    13060.2

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   587.8062          .        .       .            .           .
   /mihazank |   2.843688   .4132058     6.88   0.000     2.033093    3.654282
      /tisza |   387.7123          .        .       .            .           .
        /lmp |          0  (constrained)
     /fidesz |   .6515309   .1124384     5.79   0.000     .4309581    .8721037
         /dk |          0  (constrained)
   /momentum |   54.29432          .        .       .            .           .
  /kispartok |   1.060825   .9288837     1.14   0.254    -.7613859    2.883036
------------------------------------------------------------------------------

Iteration 0:  Residual SS =  1034370
Iteration 1:  Residual SS =   565940
Iteration 2:  Residual SS = 561202.6
Iteration 3:  Residual SS = 444898.4
Iteration 4:  Residual SS = 414984.5
Iteration 5:  Residual SS = 412343.8
Iteration 6:  Residual SS = 412343.4
Iteration 7:  Residual SS = 412343.4
Iteration 8:  Residual SS = 412343.4


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1.075e+08          4  26864605.6    R-squared     =     0.9962
    Residual |  412343.41       1350   305.43956    Adj R-squared =     0.9962
-------------+----------------------------------    Root MSE      =   17.47683
       Total |  1.079e+08       1354  79668.2171    Res. dev.     =   11585.73

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .4941508   .1390839     3.55   0.000     .2213067    .7669949
   /mihazank |   2.428318   .2280988    10.65   0.000     1.980851    2.875784
      /tisza |   1.091845   .0472392    23.11   0.000     .9991752    1.184516
        /lmp |          0  (constrained)
     /fidesz |   176.5736          .        .       .            .           .
         /dk |          0  (constrained)
   /momentum |  -.5482183   1.547983    -0.35   0.723    -3.584931    2.488494
  /kispartok |  -36081.32          .        .       .            .           .
------------------------------------------------------------------------------

Iteration 0:  Residual SS = 694451.3
Iteration 1:  Residual SS = 345880.1
Iteration 2:  Residual SS = 141414.5
Iteration 3:  Residual SS = 128803.8
Iteration 4:  Residual SS = 128579.6
Iteration 5:  Residual SS = 128579.5
Iteration 6:  Residual SS = 128579.5


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  1122842.5          3  374280.839    R-squared     =     0.8973
    Residual |  128579.48       1351  95.1735624    Adj R-squared =     0.8970
-------------+----------------------------------    Root MSE      =   9.755694
       Total |    1251422       1354  924.240768    Res. dev.     =    10007.9

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -30.13495          .        .       .            .           .
   /mihazank |  -20944.12          .        .       .            .           .
      /tisza |  -1.939663   .1271854   -15.25   0.000    -2.189165    -1.69016
        /lmp |          0  (constrained)
     /fidesz |   .3132829   .0609777     5.14   0.000     .1936616    .4329042
         /dk |          0  (constrained)
   /momentum |  -1973.825          .        .       .            .           .
  /kispartok |   1.207924   .3076398     3.93   0.000     .6044205    1.811428
------------------------------------------------------------------------------

Iteration 0:  Residual SS = 488471.1
Iteration 1:  Residual SS = 136445.8
Iteration 2:  Residual SS = 93773.67
Iteration 3:  Residual SS =  87769.8
Iteration 4:  Residual SS = 87098.12
Iteration 5:  Residual SS = 86929.43
Iteration 6:  Residual SS = 84991.95
Iteration 7:  Residual SS = 84988.26
Iteration 8:  Residual SS = 84988.26
Iteration 9:  Residual SS = 84988.26
Iteration 10: Residual SS = 84988.26
Iteration 11: Residual SS = 84988.26
Iteration 12: Residual SS = 84988.26


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,354
       Model |  454955.74          4  113738.934    R-squared     =     0.8426
    Residual |  84988.265       1350  62.9542702    Adj R-squared =     0.8421
-------------+----------------------------------    Root MSE      =   7.934373
       Total |     539944       1354  398.776957    Res. dev.     =   9447.301

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.631531   .2652716    -6.15   0.000    -2.151921   -1.111142
   /mihazank |  -.0486987   .5118989    -0.10   0.924    -1.052903    .9555051
      /tisza |  -11230.91          .        .       .            .           .
        /lmp |          0  (constrained)
     /fidesz |   .0002651   .0664479     0.00   0.997    -.1300873    .1306175
         /dk |          0  (constrained)
   /momentum |  -18984.77          .        .       .            .           .
  /kispartok |  -.2257283   .2791455    -0.81   0.419    -.7733344    .3218778
------------------------------------------------------------------------------

. scalar list
l_ervenytelen_fo_kispartok =  .29845267
l_ervenytelen_fo_momentum =          0
l_ervenytelen_fo_dk =  8.39e-228
l_ervenytelen_fo_fidesz =  .08139191
l_ervenytelen_fo_lmp =  5.80e-250
l_ervenytelen_fo_tisza =          0
l_ervenytelen_fo_mihazank =  .05650786
l_ervenytelen_fo_mkkp =  .04419772
l_grundtner_kispartok =  .64083162
l_grundtner_momentum =          0
l_grundtner_dk =  8.39e-228
l_grundtner_fidesz =  .10807411
l_grundtner_lmp =  5.80e-250
l_grundtner_tisza =  .04987313
l_grundtner_mihazank =          0
l_grundtner_mkkp =  1.933e-14
l_vitezy_kispartok =          0
l_vitezy_momentum =  .02729225
l_vitezy_dk =  8.39e-228
l_vitezy_fidesz =          1
l_vitezy_lmp =  5.80e-250
l_vitezy_tisza =  .52108626
l_vitezy_mihazank =  .41624871
l_vitezy_mkkp =  .27924785
l_karacsony_kispartok =  .60632169
l_karacsony_momentum =          1
l_karacsony_dk =  8.39e-228
l_karacsony_fidesz =  .14525431
l_karacsony_lmp =  5.80e-250
l_karacsony_tisza =          1
l_karacsony_mihazank =  .51928493
l_karacsony_mkkp =          1
logit_nest_kispartok =  1.8756376
logit_nest_momentum =  20.599411
logit_nest_dk =  1.19e+227
logit_nest_fidesz =  11.289226
logit_nest_lmp =  1.72e+249
logit_nest_tisza =  2.7386096
logit_nest_mihazank =   15.90303
logit_nest_mkkp =  4.2306108
hiba_ervenytelen_fo =  1.0820713
ervenytelen_fo_kispartok =  .29829755
b_ervenytelen_fo_kispartok = -.85541796
ervenytelen_fo_momentum =          0
b_ervenytelen_fo_momentum = -1.601e+09
ervenytelen_fo_dk =  .00526845
b_ervenytelen_fo_dk = -5.2407361
ervenytelen_fo_fidesz =  .07999135
b_ervenytelen_fo_fidesz = -2.4424645
ervenytelen_fo_lmp =  2.022e-20
b_ervenytelen_fo_lmp =  -45.34782
ervenytelen_fo_tisza =          0
b_ervenytelen_fo_tisza = -921.62606
ervenytelen_fo_mihazank =   .0501781
b_ervenytelen_fo_mihazank = -2.9406959
ervenytelen_fo_mkkp =  .04147501
b_ervenytelen_fo_mkkp = -3.1403045
hiba_grundtner =  .92788253
grundtner_kispartok =  .30282609
b_grundtner_kispartok =  -.8338762
grundtner_momentum =          0
b_grundtner_momentum = -2.307e+09
grundtner_dk =  .00190142
b_grundtner_dk = -6.2632518
grundtner_fidesz =  .02504113
b_grundtner_fidesz = -3.6618755
grundtner_lmp =  .03756261
b_grundtner_lmp = -3.2434599
grundtner_tisza =  2.67e-201
b_grundtner_tisza = -461.83766
grundtner_mihazank =  .94039276
b_grundtner_mihazank =  2.7585206
grundtner_mkkp =          0
b_grundtner_mkkp =    -4435.1
hiba_vitezy =  1.7069365
vitezy_kispartok =          0
b_vitezy_kispartok =  -9261.083
vitezy_momentum =  .00931155
b_vitezy_momentum = -4.6671449
 vitezy_dk =  1.957e-17
b_vitezy_dk = -38.472608
vitezy_fidesz =  .91787524
b_vitezy_fidesz =  2.4138219
vitezy_lmp =          1
b_vitezy_lmp =  573.88772
vitezy_tisza =  .30792302
b_vitezy_tisza = -.80984736
vitezy_mihazank =  .06865457
b_vitezy_mihazank = -2.6075425
vitezy_mkkp =  .22160985
b_vitezy_mkkp = -1.2563095
hiba_karacsony =  1.5082179
karacsony_kispartok =  .50401003
b_karacsony_kispartok =  .01604048
karacsony_momentum =  .95368229
b_karacsony_momentum =  3.0248061
karacsony_dk =          1
b_karacsony_dk =  522.86205
karacsony_fidesz =  1.161e-65
b_karacsony_fidesz =  -149.5188
karacsony_lmp =          0
b_karacsony_lmp =  -32502361
karacsony_tisza =  .69638857
b_karacsony_tisza =  .83015909
karacsony_mihazank =  1.20e-175
b_karacsony_mihazank =  -402.7689
karacsony_mkkp =   .7960282
b_karacsony_mkkp =  1.3616528

. BRK
command BRK is unrecognized
r(199);

end of do-file
r(199);
