
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum kispartok

. local jeloltek karacsony vitezy grundtner ervenytelen 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS =  1328812
Iteration 1:  Residual SS =  1235918
Iteration 2:  Residual SS =  1222553
Iteration 3:  Residual SS =  1097589
Iteration 4:  Residual SS =  1095736
Iteration 5:  Residual SS =  1095244
Iteration 6:  Residual SS =  1095197
Iteration 7:  Residual SS =  1095197
Iteration 8:  Residual SS =  1095197
Iteration 9:  Residual SS =  1095197
Iteration 10: Residual SS =  1095197
Iteration 11: Residual SS =  1095017
Iteration 12: Residual SS =  1095007
Iteration 13: Residual SS =  1095007


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        826
       Model |   57368414          4  14342103.4    R-squared     =     0.9813
    Residual |  1095007.4        822  1332.12575    Adj R-squared =     0.9812
-------------+----------------------------------    Root MSE      =    36.4983
       Total |   58463421        826    70778.96    Res. dev.     =    8282.76

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   1.025015   .2785161     3.68   0.000     .4783286    1.571701
   /mihazank |  -182.4223          .        .       .            .           .
      /tisza |   .3881063   .0917073     4.23   0.000     .2080982    .5681144
        /lmp |  -213401.8          .        .       .            .           .
     /fidesz |  -408507.6          .        .       .            .           .
         /dk |   2.104939   1.135131     1.85   0.064    -.1231569    4.333034
   /momentum |   11.18164          .        .       .            .           .
  /kispartok |   .5515535   .3176201     1.74   0.083    -.0718885    1.174996
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(276 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0277907        .000918
 5%     .1086283        .005534
10%     .2277739       .0071843       Obs                 816
25%     .5941271       .0144944       Sum of wgt.         816

50%     1.356517                      Mean           1.670009
                        Largest       Std. dev.      1.473874
75%     2.283334       8.044083
90%     3.408149       8.726593       Variance       2.172305
95%     4.267371       8.845146       Skewness       2.689983
99%     6.633598       17.49395       Kurtosis       20.93917

Iteration 0:  Residual SS =  1076193
Iteration 1:  Residual SS =  1068112
Iteration 2:  Residual SS =  1065658
Iteration 3:  Residual SS =  1065209
Iteration 4:  Residual SS =  1065078
Iteration 5:  Residual SS =  1065065
Iteration 6:  Residual SS =  1065063
Iteration 7:  Residual SS =  1065062
Iteration 8:  Residual SS =  1065062
Iteration 9:  Residual SS =  1065062
Iteration 10: Residual SS =  1065062
Iteration 11: Residual SS =  1065062
Iteration 12: Residual SS =  1065062
Iteration 13: Residual SS =  1065062
Iteration 14: Residual SS =  1046334
Iteration 15: Residual SS =  1044609
Iteration 16: Residual SS =  1044609
Iteration 17: Residual SS =  1044609


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        826
       Model |   56839142          7  8119877.43    R-squared     =     0.9820
    Residual |    1044609        819  1275.46883    Adj R-squared =     0.9818
-------------+----------------------------------    Root MSE      =   35.71371
       Total |   57883751        826  70077.1804    Res. dev.     =    8243.84

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.6613059   .2270051    -2.91   0.004    -1.106886   -.2157256
   /mihazank |  -1.187374   .8937065    -1.33   0.184    -2.941599    .5668508
      /tisza |  -.6426414   .1267522    -5.07   0.000    -.8914389    -.393844
        /lmp |   1.247543   .5940257     2.10   0.036     .0815513    2.413536
     /fidesz |   1.422053   .2475056     5.75   0.000     .9362328    1.907873
         /dk |  -1.97e+08          .        .       .            .           .
   /momentum |  -.9126565   .4327392    -2.11   0.035    -1.762065   -.0632479
  /kispartok |   -.570243    .322381    -1.77   0.077    -1.203033    .0625474
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(276 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0414281       .0054486
 5%     .1471764       .0135252
10%     .2863844       .0205877       Obs                 816
25%     .7388124       .0211467       Sum of wgt.         816

50%     1.539586                      Mean           1.854715
                        Largest       Std. dev.      1.610249
75%     2.575942       7.030372
90%     3.700512       12.13309       Variance       2.592902
95%     4.481741       14.94092       Skewness        3.34574
99%     6.579386       20.21601       Kurtosis       30.10755

Iteration 0:  Residual SS =  2298683
Iteration 1:  Residual SS = 262604.8
Iteration 2:  Residual SS = 81823.56
Iteration 3:  Residual SS = 60109.41
Iteration 4:  Residual SS = 44720.24
Iteration 5:  Residual SS = 43959.49
Iteration 6:  Residual SS = 43943.34
Iteration 7:  Residual SS = 42910.11
Iteration 8:  Residual SS = 42709.08
Iteration 9:  Residual SS = 42708.04
Iteration 10: Residual SS = 42708.04
Iteration 11: Residual SS = 42708.04


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        826
       Model |  685093.96          4  171273.491    R-squared     =     0.9413
    Residual |  42708.037        822  51.9562492    Adj R-squared =     0.9410
-------------+----------------------------------    Root MSE      =   7.208068
       Total |     727802        826  881.116223    Res. dev.     =   5603.109

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -2.92e+08          .        .       .            .           .
   /mihazank |   1.781745   .4201678     4.24   0.000      .957017    2.606473
      /tisza |  -13802.27          .        .       .            .           .
        /lmp |  -2.154653   .4434055    -4.86   0.000    -3.024993   -1.284313
     /fidesz |  -1.797575    .083124   -21.63   0.000    -1.960736   -1.634415
         /dk |  -221.9143          .        .       .            .           .
   /momentum |  -58.85804          .        .       .            .           .
  /kispartok |  -1.866933   .3074962    -6.07   0.000    -2.470503   -1.263363
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(276 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0372871       .0060444
 5%     .0902086       .0064879
10%     .1602904       .0075504       Obs                 816
25%      .426176       .0083192       Sum of wgt.         816

50%     .7775008                      Mean           .9751411
                        Largest       Std. dev.       .788911
75%     1.346289       4.593414
90%     2.006463       5.509173       Variance       .6223805
95%     2.457363       5.552607       Skewness       1.765266
99%     3.699076       5.826243       Kurtosis       8.322189

Iteration 0:  Residual SS =  2258796
Iteration 1:  Residual SS = 230680.6
Iteration 2:  Residual SS = 74588.55
Iteration 3:  Residual SS = 61132.95
Iteration 4:  Residual SS = 55247.14
Iteration 5:  Residual SS =  47839.2
Iteration 6:  Residual SS = 47643.75
Iteration 7:  Residual SS = 47632.77
Iteration 8:  Residual SS = 47632.33
Iteration 9:  Residual SS = 47632.33
Iteration 10: Residual SS = 47632.33


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =        826
       Model |  240880.67          5  48176.1342    R-squared     =     0.8349
    Residual |  47632.329        821  58.0174529    Adj R-squared =     0.8339
-------------+----------------------------------    Root MSE      =   7.616919
       Total |     288513        826  349.289346    Res. dev.     =   5693.246

------------------------------------------------------------------------------
 ervenytelen | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.747325   .1596985   -10.94   0.000    -2.060791    -1.43386
   /mihazank |   -1.56113    .308521    -5.06   0.000    -2.166713   -.9555475
      /tisza |  -27.84026          .        .       .            .           .
        /lmp |  -15.76982          .        .       .            .           .
     /fidesz |  -1.377137   .0438329   -31.42   0.000    -1.463174   -1.291099
         /dk |  -3.033954   2.185245    -1.39   0.165    -7.323279    1.255371
   /momentum |  -158.2233          .        .       .            .           .
  /kispartok |  -2.041833   .4569279    -4.47   0.000    -2.938717   -1.144948
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(276 missing values generated)

                       ae_ervenytelen
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0173359       .0021755
 5%     .0697916        .005121
10%     .1498033       .0121725       Obs                 816
25%     .3638846       .0123792       Sum of wgt.         816

50%     .7834132                      Mean           1.073601
                        Largest       Std. dev.      1.300642
75%      1.37581       8.228179
90%     2.109585       9.555181       Variance        1.69167
95%      2.83998       10.25726       Skewness       5.941629
99%     5.552173       20.18062       Kurtosis       67.89859

. 
. * manually adjust models so that each party has a share between 0 and 1
. local karacsony0 fidesz lmp mihazank

. local karacsony1 dk momentum

. local vitezy0 dk

. local vitezy1 lmp

. 
. foreach jelolt in karacsony vitezy {
  2.     generate `jelolt'_minusz = `jelolt'
  3.     foreach one in ``jelolt'1' {
  4.         replace `jelolt'_minusz = `jelolt'_minusz - `one' if `jelolt' > 0
  5.     } 
  6. }
(815 real changes made)
(816 real changes made)
(816 real changes made)

. regress karacsony_minusz mkkp tisza kispartok if part_total>0, noconstant

      Source |       SS           df       MS      Number of obs   =       826
-------------+----------------------------------   F(3, 823)       =  12031.14
       Model |  17015157.5         3  5671719.16   Prob > F        =    0.0000
    Residual |  387978.509       823  471.419817   R-squared       =    0.9777
-------------+----------------------------------   Adj R-squared   =    0.9776
       Total |    17403136       826  21069.1719   Root MSE        =    21.712

------------------------------------------------------------------------------
karacsony_~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .8177583   .0390042    20.97   0.000     .7411988    .8943177
       tisza |   .6625654   .0116716    56.77   0.000     .6396558    .6854751
   kispartok |    .692023   .0642935    10.76   0.000     .5658244    .8182215
------------------------------------------------------------------------------

. regress vitezy_minusz mkkp mihazank tisza fidesz kispartok if part_total>0, n
> oconstant

      Source |       SS           df       MS      Number of obs   =       826
-------------+----------------------------------   F(5, 821)       =   8706.33
       Model |  35065904.8         5  7013180.96   Prob > F        =    0.0000
    Residual |  661337.222       821  805.526458   R-squared       =    0.9815
-------------+----------------------------------   Adj R-squared   =    0.9814
       Total |    35727242       826  43253.3196   Root MSE        =    28.382

------------------------------------------------------------------------------
vitezy_min~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .2803054    .053718     5.22   0.000     .1748647    .3857461
    mihazank |   .0677061   .1364644     0.50   0.620    -.2001541    .3355662
       tisza |   .2679395   .0259805    10.31   0.000     .2169436    .3189355
      fidesz |   .9141854   .0270577    33.79   0.000      .861075    .9672957
   kispartok |   .2727918   .0854718     3.19   0.001     .1050229    .4405608
------------------------------------------------------------------------------

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen" if index == 4
variable jelolt was str9 now str11
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
