
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum neppartjan munkaspart
>  szolidaritas ervenytelen

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0 & `jelolt'>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS = 384708.6
Iteration 1:  Residual SS = 198130.5
Iteration 2:  Residual SS = 163361.7
Iteration 3:  Residual SS =   124366
Iteration 4:  Residual SS = 120913.3
Iteration 5:  Residual SS = 119181.7
Iteration 6:  Residual SS = 119181.7
Iteration 7:  Residual SS = 119181.7


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,078
       Model |   81221362          6  13536893.7    R-squared     =     0.9985
    Residual |  119181.71       1072  111.176964    Adj R-squared =     0.9985
-------------+----------------------------------    Root MSE      =   10.54405
       Total |   81340544       1078  75455.0501    Res. dev.     =   8131.806

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .8103712    .064698    12.53   0.000     .6834222    .9373202
   /mihazank |  -38.81714          .        .       .            .           .
      /tisza |   .4312595   .0175567    24.56   0.000     .3968101    .4657089
        /lmp |  -11.98669          .        .       .            .           .
     /fidesz |  -5.38e+07          .        .       .            .           .
         /dk |   7847.213          .        .       .            .           .
   /momentum |   1.892879   .4202007     4.50   0.000      1.06837    2.717388
 /neppartjan |  -7.292995          .        .       .            .           .
 /munkaspart |     .40365   .0928179     4.35   0.000     .2215247    .5857753
/szolidari~s |   .8382162   .3382406     2.48   0.013     .1745275    1.501905
/ervenytelen |  -.0830703   .1152685    -0.72   0.471    -.3092478    .1431073
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(129 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%       .02864       .0000107
 5%      .126842       .0047737
10%     .2342305       .0048388       Obs               1,078
25%     .6120271       .0066326       Sum of wgt.       1,078

50%     1.225985                      Mean            1.49758
                        Largest       Std. dev.      1.206772
75%     2.075848       6.409111
90%      3.08033       6.805774       Variance       1.456299
95%      3.84344       7.268065       Skewness       1.371341
99%     5.410669       7.825675       Kurtosis       5.398416

Iteration 0:  Residual SS = 168574.3
Iteration 1:  Residual SS = 154762.9
Iteration 2:  Residual SS = 153139.2
Iteration 3:  Residual SS = 151854.4
Iteration 4:  Residual SS = 143698.6
Iteration 5:  Residual SS = 143686.1
Iteration 6:  Residual SS =   143686
Iteration 7:  Residual SS =   143686
Iteration 8:  Residual SS =   143686


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,078
       Model |   80680742          8  10085092.7    R-squared     =     0.9982
    Residual |  143686.03       1070  134.286012    Adj R-squared =     0.9982
-------------+----------------------------------    Root MSE      =   11.58818
       Total |   80824428       1078  74976.2783    Res. dev.     =   8333.371

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7382409   .0697457   -10.58   0.000    -.8750947   -.6013871
   /mihazank |  -1.504389   .3757052    -4.00   0.000    -2.241591   -.7671863
      /tisza |  -.5031936   .0282309   -17.82   0.000    -.5585877   -.4477995
        /lmp |   54370.88          .        .       .            .           .
     /fidesz |   1.246754   .0535496    23.28   0.000      1.14168    1.351828
         /dk |  -10359.83          .        .       .            .           .
   /momentum |  -1.800729   .3937068    -4.57   0.000    -2.573254   -1.028204
 /neppartjan |    -517391          .        .       .            .           .
 /munkaspart |  -.5754948   .1120712    -5.14   0.000     -.795399   -.3555907
/szolidari~s |  -1.195088   .5348384    -2.23   0.026    -2.244539   -.1456367
/ervenytelen |  -.6842848   .1659954    -4.12   0.000    -1.009998   -.3585714
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(129 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0275506       .0061217
 5%     .1158165       .0064106
10%     .2593955       .0100069       Obs               1,078
25%     .6696731        .011246       Sum of wgt.       1,078

50%     1.365446                      Mean           1.695486
                        Largest       Std. dev.      1.508693
75%     2.339151       8.281974
90%     3.474117       9.086544       Variance       2.276153
95%     4.294567       14.94057       Skewness       3.670684
99%     6.144873       21.71383       Kurtosis       37.58167

Iteration 0:  Residual SS =  3267398
Iteration 1:  Residual SS = 355057.9
Iteration 2:  Residual SS = 98511.21
Iteration 3:  Residual SS = 67413.87
Iteration 4:  Residual SS = 48554.43
Iteration 5:  Residual SS = 47294.12
Iteration 6:  Residual SS = 43042.25
Iteration 7:  Residual SS =  41935.7
Iteration 8:  Residual SS = 41930.59
Iteration 9:  Residual SS = 41930.58
Iteration 10: Residual SS = 41930.58


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,078
       Model |  955632.42          6  159272.069    R-squared     =     0.9580
    Residual |  41930.585       1072  39.1143517    Adj R-squared =     0.9577
-------------+----------------------------------    Root MSE      =   6.254147
       Total |     997563       1078  925.383117    Res. dev.     =    7005.69

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.70e+08          .        .       .            .           .
   /mihazank |   1.450899   .1834315     7.91   0.000     1.090973    1.810824
      /tisza |  -49.43252          .        .       .            .           .
        /lmp |  -1.872905   .1824165   -10.27   0.000    -2.230839   -1.514971
     /fidesz |  -2.026922   .0958222   -21.15   0.000    -2.214943   -1.838902
         /dk |  -392.2603          .        .       .            .           .
   /momentum |  -12.21142          .        .       .            .           .
 /neppartjan |   7.028809          .        .       .            .           .
 /munkaspart |  -2.234887   .6145506    -3.64   0.000    -3.440746   -1.029029
/szolidari~s |    -1.5089   .4409807    -3.42   0.001    -2.374184   -.6436171
/ervenytelen |  -.9416995   .1095883    -8.59   0.000    -1.156731   -.7266676
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(129 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0233222       .0038936
 5%     .0894624       .0048469
10%     .1640324        .006354       Obs               1,078
25%     .3973145         .00738       Sum of wgt.       1,078

50%     .7556703                      Mean           .9314831
                        Largest       Std. dev.       .741431
75%     1.286123       4.052563
90%     1.917183       4.541722       Variance         .54972
95%     2.342595       4.930963       Skewness       1.629142
99%     3.444521       6.243743       Kurtosis       7.637122

Iteration 0:  Residual SS =  3313806
Iteration 1:  Residual SS = 350341.8
Iteration 2:  Residual SS = 107737.9
Iteration 3:  Residual SS = 80521.62
Iteration 4:  Residual SS = 63846.98
Iteration 5:  Residual SS =  63449.9
Iteration 6:  Residual SS = 52431.17
Iteration 7:  Residual SS = 52086.41
Iteration 8:  Residual SS = 52070.52
Iteration 9:  Residual SS = 52070.01
Iteration 10: Residual SS = 52056.48
Iteration 11: Residual SS = 52056.48
Iteration 12: Residual SS = 52056.48


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,078
       Model |  355518.52          6   59253.086    R-squared     =     0.8723
    Residual |  52056.484       1072  48.5601529    Adj R-squared =     0.8716
-------------+----------------------------------    Root MSE      =   6.968512
       Total |     407575       1078  378.084416    Res. dev.     =   7238.877

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.719013   .1197573   -14.35   0.000    -1.953998   -1.484028
   /mihazank |  -1.926005   .4366094    -4.41   0.000    -2.782711   -1.069299
      /tisza |   -3016466          .        .       .            .           .
        /lmp |  -188127.4          .        .       .            .           .
     /fidesz |  -1.532621   .0428748   -35.75   0.000    -1.616749   -1.448493
         /dk |  -1108.093          .        .       .            .           .
   /momentum |  -131531.3          .        .       .            .           .
 /neppartjan |   511.1529          .        .       .            .           .
 /munkaspart |  -2.286442   .7683381    -2.98   0.003    -3.794059   -.7788245
/szolidari~s |   -1.91628   .9863845    -1.94   0.052    -3.851743    .0191835
/ervenytelen |  -.2773205   .0809952    -3.42   0.001    -.4362477   -.1183934
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(129 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0175868       .0009381
 5%     .0581725       .0011454
10%     .1270629       .0027354       Obs               1,078
25%     .3373005       .0038601       Sum of wgt.       1,078

50%     .7288871                      Mean           .9832587
                        Largest       Std. dev.      1.089421
75%     1.277237        7.21385
90%     1.943849       7.939553       Variance       1.186838
95%     2.615485       8.405108       Skewness       5.592339
99%     4.988525       18.34967       Kurtosis       68.99484

. 
. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
