
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum neppartjan munkaspart
>  szolidaritas 

. local jeloltek karacsony vitezy grundtner ervenytelen_fo 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. 
. local formula 0

. foreach part in `partok' {
  2.     local formula `formula' + normal({`part'})*`part'
  3. }

. 
. foreach jelolt in `jeloltek' {
  2.     nl (`jelolt' = `formula') if part_total>0 & `jelolt'>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = normal(_b[/`part'])
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(mean)
 11. }

Iteration 0:  Residual SS = 383099.7
Iteration 1:  Residual SS = 202845.8
Iteration 2:  Residual SS = 169396.4
Iteration 3:  Residual SS = 161904.5
Iteration 4:  Residual SS = 159957.2
Iteration 5:  Residual SS = 159955.1
Iteration 6:  Residual SS = 156148.7
Iteration 7:  Residual SS = 156148.5
Iteration 8:  Residual SS = 156148.5


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,308
       Model |  1.050e+08          5  21002967.3    R-squared     =     0.9985
    Residual |  156148.53       1303  119.837703    Adj R-squared =     0.9985
-------------+----------------------------------    Root MSE      =   10.94704
       Total |  1.052e+08       1308  80405.9518    Res. dev.     =   9967.203

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |   .8213294   .0627233    13.09   0.000     .6982797     .944379
   /mihazank |  -812.8552          .        .       .            .           .
      /tisza |   .5123723   .0154376    33.19   0.000     .4820871    .5426575
        /lmp |  -9.071237          .        .       .            .           .
     /fidesz |  -148.4389          .        .       .            .           .
         /dk |   7.615868          .        .       .            .           .
   /momentum |   1.783692    .318979     5.59   0.000     1.157924    2.409461
 /neppartjan |  -11.30273          .        .       .            .           .
 /munkaspart |   .4112076   .0961929     4.27   0.000     .2224977    .5999174
/szolidari~s |   .9772602   .3903735     2.50   0.012     .2114308     1.74309
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(14 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0198334       .0001962
 5%     .1130676       .0009623
10%     .2262981       .0010878       Obs               1,308
25%     .5922199       .0018629       Sum of wgt.       1,308

50%     1.223702                      Mean           1.503544
                        Largest       Std. dev.      1.236224
75%     2.065296       7.296546
90%     3.203518       7.395483       Variance        1.52825
95%     3.902618       8.053002       Skewness       1.507438
99%     5.482554       8.128544       Kurtosis       6.153187

Iteration 0:  Residual SS = 211745.4
Iteration 1:  Residual SS = 192992.4
Iteration 2:  Residual SS = 191974.2
Iteration 3:  Residual SS = 191974.1
Iteration 4:  Residual SS = 191974.1
Iteration 5:  Residual SS = 191974.1
Iteration 6:  Residual SS = 191974.1
Iteration 7:  Residual SS = 191974.1
Iteration 8:  Residual SS = 191974.1
Iteration 9:  Residual SS = 191974.1
Iteration 10: Residual SS = 191974.1
Iteration 11: Residual SS = 191974.1
Iteration 12: Residual SS = 186510.4
Iteration 13: Residual SS = 185090.2
Iteration 14: Residual SS = 185088.9
Iteration 15: Residual SS = 185088.9
Iteration 16: Residual SS = 185088.9


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,308
       Model |  1.029e+08          7  14694281.3    R-squared     =     0.9982
    Residual |  185088.92       1301  142.266659    Adj R-squared =     0.9982
-------------+----------------------------------    Root MSE      =   11.92756
       Total |  1.030e+08       1308  78780.6254    Res. dev.     =    10189.6

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -.7636885   .0681957   -11.20   0.000    -.8974741   -.6299028
   /mihazank |  -1.409922   .2999453    -4.70   0.000    -1.998351   -.8214922
      /tisza |  -.5027406   .0256296   -19.62   0.000    -.5530205   -.4524607
        /lmp |   7.742886          .        .       .            .           .
     /fidesz |   1.363265    .054857    24.85   0.000     1.255647    1.470883
         /dk |  -8.53e+07          .        .       .            .           .
   /momentum |  -2.344362    1.11439    -2.10   0.036     -4.53056   -.1581639
 /neppartjan |  -373991.1          .        .       .            .           .
 /munkaspart |   -.590928    .115716    -5.11   0.000    -.8179384   -.3639176
/szolidari~s |  -1.660604    1.04917    -1.58   0.114    -3.718853     .397646
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(14 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0238088       .0022217
 5%     .1206746       .0022828
10%      .228265       .0047212       Obs               1,308
25%     .6605828       .0055433       Sum of wgt.       1,308

50%     1.425475                      Mean           1.692614
                        Largest       Std. dev.      1.474367
75%     2.308292       8.046061
90%     3.496273       9.244431       Variance       2.173757
95%     4.357099       15.32482       Skewness       3.191013
99%     6.117286       20.82079       Kurtosis       30.69549

Iteration 0:  Residual SS =  4030656
Iteration 1:  Residual SS = 426663.3
Iteration 2:  Residual SS = 110634.2
Iteration 3:  Residual SS = 81108.42
Iteration 4:  Residual SS = 55941.82
Iteration 5:  Residual SS = 54365.92
Iteration 6:  Residual SS = 51510.02
Iteration 7:  Residual SS = 51437.93
Iteration 8:  Residual SS = 51340.61
Iteration 9:  Residual SS = 51340.58
Iteration 10: Residual SS = 51340.58


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,308
       Model |  1166107.4          5  233221.483    R-squared     =     0.9578
    Residual |  51340.585       1303  39.4018304    Adj R-squared =     0.9577
-------------+----------------------------------    Root MSE      =   6.277088
       Total |    1217448       1308  930.770642    Res. dev.     =    8512.28

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.27e+07          .        .       .            .           .
   /mihazank |   1.394138    .151087     9.23   0.000     1.097738    1.690539
      /tisza |  -7.39e+07          .        .       .            .           .
        /lmp |  -1.727187   .1264344   -13.66   0.000    -1.975224   -1.479149
     /fidesz |  -1.922926    .067533   -28.47   0.000    -2.055411   -1.790441
         /dk |  -8.044028          .        .       .            .           .
   /momentum |  -19.78042          .        .       .            .           .
 /neppartjan |    3371274          .        .       .            .           .
 /munkaspart |  -2.323736   .7527184    -3.09   0.002    -3.800409   -.8470639
/szolidari~s |  -1.327184   .3353985    -3.96   0.000    -1.985165   -.6692042
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(14 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0171617       .0008822
 5%     .0728305       .0012195
10%     .1525306       .0022996       Obs               1,308
25%     .3927514       .0053607       Sum of wgt.       1,308

50%     .7316941                      Mean           .9192977
                        Largest       Std. dev.      .7530181
75%      1.28575       4.483922
90%     1.873185       5.273843       Variance       .5670362
95%     2.339216       5.885724       Skewness       1.803085
99%     3.512762       6.393999       Kurtosis       8.824031

Iteration 0:  Residual SS =  3975481
Iteration 1:  Residual SS = 404454.8
Iteration 2:  Residual SS = 129106.3
Iteration 3:  Residual SS = 99455.02
Iteration 4:  Residual SS = 82164.67
Iteration 5:  Residual SS = 81625.34
Iteration 6:  Residual SS = 81620.56
Iteration 7:  Residual SS = 77884.21
Iteration 8:  Residual SS =  77795.9
Iteration 9:  Residual SS = 77790.95
Iteration 10: Residual SS =  77790.8
Iteration 11: Residual SS =  77790.8
Iteration 12: Residual SS =  77790.8


      Source |      SS            df       MS
-------------+----------------------------------    Number of obs =      1,308
       Model |   433341.2          7  61905.8857    R-squared     =     0.8478
    Residual |    77790.8       1301  59.7930821    Adj R-squared =     0.8470
-------------+----------------------------------    Root MSE      =   7.732599
       Total |     511132       1308    390.7737    Res. dev.     =   9055.808

------------------------------------------------------------------------------
ervenytele~o | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       /mkkp |  -1.672776   .1196989   -13.97   0.000      -1.9076   -1.437952
   /mihazank |  -1.964595   .5002323    -3.93   0.000    -2.945945   -.9832448
      /tisza |   -46.9805          .        .       .            .           .
        /lmp |  -1581.424          .        .       .            .           .
     /fidesz |  -1.381311   .0344226   -40.13   0.000    -1.448841   -1.313781
         /dk |  -3.144024   2.464322    -1.28   0.202    -7.978503    1.690455
   /momentum |  -40.09247          .        .       .            .           .
 /neppartjan |   1.410847   1.235862     1.14   0.254    -1.013653    3.835347
 /munkaspart |  -3.383751   19.08882    -0.18   0.859    -40.83198    34.06448
/szolidari~s |  -1.123882   .3238511    -3.47   0.001    -1.759209   -.4885542
------------------------------------------------------------------------------
(option yhat assumed; fitted values)
(14 missing values generated)

                      ae_ervenytelen_fo
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0180253       .0012612
 5%     .0695558       .0014068
10%     .1727855       .0020797       Obs               1,308
25%     .3878595       .0038059       Sum of wgt.       1,308

50%     .7847798                      Mean            1.07186
                        Largest       Std. dev.      1.179869
75%     1.383045       8.315735
90%     2.125531       9.681315       Variance        1.39209
95%     3.003203       9.768292       Skewness       5.421029
99%      5.39436        20.3321       Kurtosis        65.3338

. 
. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok' 

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen_fo" if index == 4
variable jelolt was str9 now str14
(1 real change made)

. 
. foreach part in `partok'  {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7.     replace `part' = round(`part')
  8. }
(1 real change made)
(1 real change made)
(0 real changes made)
(1 real change made)
(3 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(0 real changes made)
(2 real changes made)
(0 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(3 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(0 real changes made)
(0 real changes made)
(2 real changes made)
(1 real change made)
(0 real changes made)
(1 real change made)
(1 real change made)
(2 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(4 real changes made)

. 
. keep jelolt `partok' 

. export delimited "data/2024/budapest_becsles.csv", replace
file data/2024/budapest_becsles.csv saved

. 
end of do-file
