
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate.do 

. clear

. use "data/2024/budapest.dta"

. egen szavazokor = group(MAZ TAZ TEVK szavkor)

. 
. local partok mkkp mihazank tisza lmp fidesz dk momentum 

. local kispartok neppartjan munkaspart szolidaritas 

. local jeloltek karacsony vitezy grundtner ervenytelen 

. 
. generate total = karacsony + vitezy + grundtner

. generate part_total = mkkp + mihazank + neppartjan + munkaspart + szolidarita
> s + tisza + lmp + fidesz + dk

. generate kispartok = neppartjan + munkaspart + szolidaritas

. generate fidesz_share = fidesz / part_total
(751 missing values generated)

. foreach p in `partok' {
  2.     generate `p'_X_fidesz = `p' * fidesz_share
  3. }
(751 missing values generated)
(751 missing values generated)
(751 missing values generated)
(751 missing values generated)
(751 missing values generated)
(751 missing values generated)
(751 missing values generated)

. 
. foreach jelolt in `jeloltek' {
  2.     regress `jelolt' `partok' kispartok if part_total>0, noconstant
  3.     foreach part in `partok' {
  4.         scalar `jelolt'_`part' = _b[`part']
  5.         *assert inrange(`jelolt'_`part', 0, 1)
.     }
  6.     predict `jelolt'_predict, xb
  7.     generate ae_`jelolt' = abs(`jelolt'_predict - `jelolt') / total * 100
  8.     scatter `jelolt' `jelolt'_predict, msize(tiny)
  9. 
.     * evaluate model
.     summarize ae_`jelolt' if `jelolt'>0 & `jelolt'_predict>0, detail
 10.     scalar hiba_`jelolt' = r(p95)
 11. }

      Source |       SS           df       MS      Number of obs   =       603
-------------+----------------------------------   F(8, 595)       =   3918.09
       Model |  39469177.7         8  4933647.21   Prob > F        =    0.0000
    Residual |  749221.335       595  1259.19552   R-squared       =    0.9814
-------------+----------------------------------   Adj R-squared   =    0.9811
       Total |    40218399       603  66697.1791   Root MSE        =    35.485

------------------------------------------------------------------------------
   karacsony | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .6660663    .085644     7.78   0.000      .497865    .8342676
    mihazank |  -.1946736    .208962    -0.93   0.352    -.6050664    .2157191
       tisza |   .7037591   .0552591    12.74   0.000     .5952324    .8122857
         lmp |  -.0401709    .130668    -0.31   0.759    -.2967975    .2164558
      fidesz |  -.0257363   .0415643    -0.62   0.536    -.1073669    .0558943
          dk |   1.027559      .0614    16.74   0.000     .9069719    1.148146
    momentum |   1.228101   .1484825     8.27   0.000     .9364879    1.519715
   kispartok |   .7182958   .1111545     6.46   0.000     .4999929    .9365987
------------------------------------------------------------------------------
(444 missing values generated)

                        ae_karacsony
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0312418       .0046119
 5%     .1362764       .0129308
10%     .2398117       .0129862       Obs                 595
25%     .6238577       .0162308       Sum of wgt.         595

50%     1.433698                      Mean           1.751903
                        Largest       Std. dev.       1.45384
75%     2.469244       7.268888
90%     3.699629       7.595674       Variance       2.113652
95%     4.474456       8.381704       Skewness       1.439801
99%     6.648551       10.10842       Kurtosis        6.09543

      Source |       SS           df       MS      Number of obs   =       603
-------------+----------------------------------   F(8, 595)       =   3658.28
       Model |  39310452.4         8  4913806.55   Prob > F        =    0.0000
    Residual |  799205.586       595  1343.20267   R-squared       =    0.9801
-------------+----------------------------------   Adj R-squared   =    0.9798
       Total |    40109658       603  66516.8458   Root MSE        =     36.65

------------------------------------------------------------------------------
      vitezy | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .1262494   .0884548     1.43   0.154    -.0474721    .2999709
    mihazank |   .1244224   .2158199     0.58   0.564     -.299439    .5482838
       tisza |   .3414553   .0570727     5.98   0.000     .2293669    .4535436
         lmp |   1.017491   .1349564     7.54   0.000     .7524419     1.28254
      fidesz |   .8565143   .0429284    19.95   0.000     .7722046    .9408239
          dk |  -.0767714    .063415    -1.21   0.227    -.2013159    .0477732
    momentum |    .276996   .1533555     1.81   0.071     -.024188    .5781799
   kispartok |   .2842269   .1148025     2.48   0.014     .0587596    .5096943
------------------------------------------------------------------------------
(444 missing values generated)

                          ae_vitezy
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0260244       .0027952
 5%     .1413071       .0099895
10%     .2797632       .0188473       Obs                 595
25%     .7426901       .0190735       Sum of wgt.         595

50%     1.570771                      Mean            1.89295
                        Largest       Std. dev.      1.635395
75%     2.733514       8.517191
90%     3.818376         11.547       Variance       2.674518
95%     4.586471       12.99138       Skewness       2.801542
99%     7.053717       17.27753       Kurtosis        20.8547

      Source |       SS           df       MS      Number of obs   =       603
-------------+----------------------------------   F(8, 595)       =   1268.16
       Model |  482934.757         8  60366.8446   Prob > F        =    0.0000
    Residual |  28323.2433       595  47.6020897   R-squared       =    0.9446
-------------+----------------------------------   Adj R-squared   =    0.9439
       Total |      511258       603   847.85738   Root MSE        =    6.8994

------------------------------------------------------------------------------
   grundtner | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |  -.0843862   .0166519    -5.07   0.000    -.1170898   -.0516826
    mihazank |   .8871025   .0406288    21.83   0.000     .8073093    .9668958
       tisza |   .0078644   .0107441     0.73   0.464    -.0132366    .0289654
         lmp |   .0740166    .025406     2.91   0.004     .0241203    .1239129
      fidesz |   .0481318   .0080814     5.96   0.000     .0322603    .0640034
          dk |   .0009163   .0119381     0.08   0.939    -.0225296    .0243622
    momentum |  -.0473075   .0288697    -1.64   0.102    -.1040064    .0093913
   kispartok |   .0296445   .0216119     1.37   0.171    -.0128004    .0720895
------------------------------------------------------------------------------
(444 missing values generated)

                        ae_grundtner
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .028455       .0013912
 5%     .0890207        .014872
10%     .1500462       .0188255       Obs                 595
25%     .3430925       .0255488       Sum of wgt.         595

50%     .7153719                      Mean           .9088967
                        Largest       Std. dev.       .784908
75%     1.222468       4.080061
90%     1.982812       4.201025       Variance       .6160805
95%     2.406235       5.065376       Skewness       1.736082
99%     3.728161       5.533802       Kurtosis       7.470152

      Source |       SS           df       MS      Number of obs   =       603
-------------+----------------------------------   F(8, 595)       =    384.29
       Model |  169227.023         8  21153.3778   Prob > F        =    0.0000
    Residual |  32751.9774       595  55.0453402   R-squared       =    0.8378
-------------+----------------------------------   Adj R-squared   =    0.8357
       Total |      201979       603  334.956882   Root MSE        =    7.4193

------------------------------------------------------------------------------
 ervenytelen | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |    .047385   .0179065     2.65   0.008     .0122174    .0825527
    mihazank |    .068352   .0436899     1.56   0.118    -.0174532    .1541571
       tisza |  -.0132702   .0115536    -1.15   0.251     -.035961    .0094206
         lmp |  -.0360605   .0273201    -1.32   0.187    -.0897161    .0175952
      fidesz |    .096156   .0086903    11.06   0.000     .0790887    .1132234
          dk |    .025885   .0128375     2.02   0.044     .0006726    .0510974
    momentum |  -.0234096   .0310448    -0.75   0.451    -.0843803    .0375612
   kispartok |   .0103628   .0232402     0.45   0.656    -.0352801    .0560057
------------------------------------------------------------------------------
(444 missing values generated)

                       ae_ervenytelen
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0270186       .0037274
 5%     .0984077       .0049135
10%     .1744167       .0067519       Obs                 595
25%     .3389596       .0091215       Sum of wgt.         595

50%     .7898412                      Mean           1.096791
                        Largest       Std. dev.      1.381011
75%     1.386144       8.234034
90%     2.138946       9.291298       Variance       1.907191
95%     3.098792       9.925291       Skewness       6.054031
99%     7.461412       19.78207       Kurtosis       65.79544

. 
. * manually adjust models so that each party has a share between 0 and 1
. generate karacsony_minusz = karacsony - dk - momentum

. regress karacsony_minusz mkkp tisza kispartok if part_total>0, noconstant

      Source |       SS           df       MS      Number of obs   =       603
-------------+----------------------------------   F(3, 600)       =   3057.32
       Model |  11564447.2         3  3854815.73   Prob > F        =    0.0000
    Residual |  756507.806       600  1260.84634   R-squared       =    0.9386
-------------+----------------------------------   Adj R-squared   =    0.9383
       Total |    12320955       603  20432.7612   Root MSE        =    35.508

------------------------------------------------------------------------------
karacsony_~z | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        mkkp |   .7130686   .0753678     9.46   0.000     .5650519    .8610853
       tisza |   .6792563   .0228483    29.73   0.000     .6343839    .7241287
   kispartok |   .6985416   .1061348     6.58   0.000     .4901007    .9069825
------------------------------------------------------------------------------

. 
. * estimate total number of votes by combination of parties and candidates
. collapse (sum) `partok'

. expand 4
(3 observations created)

. egen index = seq()

. generate jelolt = "karacsony" if index == 1
(3 missing values generated)

. replace jelolt = "vitezy" if index == 2
(1 real change made)

. replace jelolt = "grundtner" if index == 3
(1 real change made)

. replace jelolt = "ervenytelen" if index == 4
variable jelolt was str9 now str11
(1 real change made)

. 
. foreach part in `partok' {
  2.     rename `part' `part'_szavazatok
  3.     generate `part' = 0
  4.     foreach jelolt in `jeloltek' {
  5.         replace `part' = `jelolt'_`part' * `part'_szavazatok if jelolt == 
> "`jelolt'"
  6.     }
  7. }
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)
(1 real change made)

. 
. list jelolt `partok'

     +-------------------------------------------------------------+
  1. |      jelolt |      mkkp |  mihazank |     tisza |       lmp |
     |   karacsony |   17119.9 | -2477.027 |   62399.5 | -1311.981 |
     |-------------------------------------------------------------|
     |        fidesz     |            dk      |      momentum      |
     |     -2418.006     |      54046.52      |      19049.08      |
     +-------------------------------------------------------------+

     +-------------------------------------------------------------+
  2. |      jelolt |      mkkp |  mihazank |     tisza |       lmp |
     |      vitezy |  3244.989 |   1583.15 |  30275.47 |  33231.25 |
     |-------------------------------------------------------------|
     |        fidesz     |            dk      |      momentum      |
     |      80472.09     |     -4037.944      |      4296.484      |
     +-------------------------------------------------------------+

     +-------------------------------------------------------------+
  3. |      jelolt |      mkkp |  mihazank |     tisza |       lmp |
     |   grundtner | -2168.979 |  11287.49 |  697.3071 |  2417.382 |
     |-------------------------------------------------------------|
     |        fidesz     |            dk      |      momentum      |
     |      4522.129     |      48.19336      |     -733.7869      |
     +-------------------------------------------------------------+

     +-------------------------------------------------------------+
  4. |      jelolt |      mkkp |  mihazank |     tisza |       lmp |
     | ervenytelen |  1217.938 |  869.7104 | -1176.619 | -1177.735 |
     |-------------------------------------------------------------|
     |        fidesz     |            dk      |      momentum      |
     |      9034.148     |      1361.473      |     -363.1057      |
     +-------------------------------------------------------------+

. 
end of do-file
